<!DOCTYPE html>
<html lang="en">
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8">
		
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Unidad 5 Lab 3: Transformando datos en información, Página 1</title>
	</head>

	<body>
        <h2>An&aacute;lisis de los datos de la salud mundial</h2>
		<div class="learn">
        	<p><strong>En esta p&aacute;gina</strong>, aprender&aacute;s c&oacute;mo la visualizaci&oacute;n de datos puede ayudar a la gente a entender los datos.</p>
        </div>
        
        <p>Los grandes conjuntos de datos pueden ser abrumadores de analizar, pero las herramientas de software pueden ayudar a las personas a extraer informaci&oacute;n, identificar tendencias, hacer conexiones y resolver problemas con los datos. Los programas de software, como el siguiente gr&aacute;fico de Google, pueden permitirte procesar los datos de forma interactiva para obtener informaci&oacute;n y conocimientos.</p>
        
        <div class="forYouToDo" id="first">
			<ol>
            	<img class="imageRight" src="/bjc-r/img/icons/talk-with-your-partner.es.png" alt="Habla con tu compañero" title="Habla con tu compañero"> 
                <li>
                    <div class="sidenoteBig">Si el gr&aacute;fico interactivo no funciona en esta p&aacute;gina, puedes <a href="https://www.google.com/publicdata/explore?hl=es&ds=d5bncppjof8f9_&ctype=b&strail=false&bcs=d&nselm=s&met_x=sp_dyn_le00_in&scale_x=lin&ind_x=false&met_y=sp_dyn_tfrt_in&scale_y=lin&ind_y=false&met_s=sp_pop_totl&scale_s=lin&ind_s=false&dimp_c=country:region&ifdim=country&tunit=Y&pit=1437710400000&ind=false&icfg&iconSize=0.5" target="_blank" title="Fertility rate vs Life expectancy graph on Google">visitarla en google.com</a>.</div>
                	<strong>Explora</strong> el siguiente conjunto de datos interactivos. 
                    <ol>
                    	<li>&iquest;Qu&eacute; representa cada punto?</li>
                        <li>
                            &iquest;Qu&eacute; representa cada eje?
                        	<a href="#hint-axes" data-toggle="collapse" title="Reveal a hint about the axes.">Revela una pista sobre los ejes.</a>
                        	<div id="hint-axes" class="collapse"><small>Si est&aacute;s viendo los datos de esta p&aacute;gina, la etiqueta del eje vertical est&aacute; en la parte superior de ese eje. (Si lo est&aacute;s viendo directamente en google.com, es a lo largo de la izquierda donde suele aparecer.)</small></div>
                        </li>
                    	<li>&iquest;Qu&eacute; respresentan los colores?</li>
                    	<li>&iquest;Qu&eacute; indica el tama&ntilde;o de cada punto?</li>
                    	<li>Qu&eacute; hace el deslizador de la parte inferior?</li>
                    </ol>
                    <iframe scrolling="no" marginwidth="0" marginheight="0" src="https://www.google.com/publicdata/embed?ds=d5bncppjof8f9_&amp;ctype=b&amp;strail=false&amp;bcs=d&amp;nselm=s&amp;met_x=sp_dyn_le00_in&amp;scale_x=lin&amp;ind_x=false&amp;met_y=sp_dyn_tfrt_in&amp;scale_y=lin&amp;ind_y=false&amp;met_s=sp_pop_totl&amp;scale_s=lin&amp;ind_s=false&amp;dimp_c=country:region&amp;ifdim=country&amp;tunit=Y&amp;pit=1437710400000&amp;hl=es&amp;dl=es&amp;ind=false&amp;icfg&amp;iconSize=0.5" height="650" frameborder="0" width="800"></iframe>
                </li>
                <li>
                    <img class="imageRight" src="/bjc-r/img/icons/talk-with-your-partner-mini.es.png" alt="Habla con tu compañero" title="Habla con tu compañero">
                    <strong>Analiza</strong> los datos. En el gr&aacute;fico interactivo de arriba, haz clic en el bot&oacute;n de reproducci&oacute;n en la parte inferior izquierda o mueve el control deslizante en la parte inferior. Discute lo siguiente:
                    <ol>
                    	<li>&iquest;Qu&eacute; te dice este conjunto de datos interactivos sobre las tendencias globales de la esperanza de vida a lo largo del tiempo (en promedio)?</li>
                    	<li>&iquest;Qu&eacute; hay sobre las tendencias mundiales de la fecundidad a lo largo del tiempo (en promedio)?</li>
                    </ol>
                </li>
                <li>
                    <div class="comment">DAT-2.E, DAT-2.E.3 clustering only</div>
                    La visualizaci&oacute;n de los cl&uacute;steres en los datos puede ayudarle a obtener informaci&oacute;n y conocimientos. <strong>Haz alguna investigaci&oacute;n</strong> en l&iacute;nea o en la biblioteca que te ayude a responder lo siguiente:
                    
<ol>
                        <li>Mueve el deslizador a 1960 (todo al lado izquierdo), y describe el significado del cluster de puntos de datos naranjas en la parte inferior derecha. &iquest;Qu&eacute; te dice esto sobre las tendencias en esta regi&oacute;n del mundo en ese momento?</li>
                        <li>Mueve el deslizador hasta 2016 (todo el lado derecho) y describe el significado del cluster de puntos de datos rosados en la parte superior izquierda. &iquest;Qu&eacute; te dice esto sobre las tendencias en esta regi&oacute;n del mundo en ese momento?</li>
                        <li>Mueve el deslizador hacia atr&aacute;s y hacia adelante a trav&eacute;s del tiempo, y selecciona un pa&iacute;s que siga un camino que te interese. Describe lo que esto te dice sobre la esperanza de vida y la fertilidad de este pa&iacute;s a lo largo de este per&iacute;odo de tiempo. </li>
                    </ol>
                </li>
            </ol>
        </div>
        
        <p>En el lenguaje ordinario, las palabras "datos" e "informaci&oacute;n" se utilizan indistintamente. Pero en inform&aacute;tica, estas palabras tienen significados t&eacute;cnicos espec&iacute;ficos.</p><strong>Vocabulario Datos</strong> vs. <strong>Informaci&oacute;n</strong>
            <div class="vocabFullWidth">
<div class="comment">DAT-2.A.1</div>
            <ul>
                <li><strong>Los datos</strong> son los valores que los ordenadores reciben de varias fuentes, incluyendo la actividad humana, los sensores, etc.</li>
                <li><strong>La informaci&oacute;n </strong>son los patrones humanamente &uacute;tiles extra&iacute;dos de los datos.</li>
            </ul>
            <p></p>
<div class="comment">DAT-2.A.2</div>Los datos proporcionan oportunidades para identificar tendencias, establecer conexiones y abordar problemas. La informaci&oacute;n es el resultado del an&aacute;lisis de esos datos.
<p></p>
        </div>
    
        <p>Los datos del gr&aacute;fico anterior nos permiten responder a algunas preguntas pero no a otras. Podemos, por ejemplo, responder a preguntas sobre c&oacute;mo los patrones de fertilidad y de esperanza de vida difieren de un continente a otro, pero no a preguntas sobre c&oacute;mo la esperanza de vida se ve afectada por los trabajos que la gente hace, porque los datos mostrados no muestran los trabajos.</p>
        
        <div class="forYouToDo">
			<ol start="4">
                <li>
                    <div class="comment">DAT-2.E.5</div>
                    En cualquier a&ntilde;o, el gr&aacute;fico tiene una pendiente descendente. Es decir, los pa&iacute;ses con una mayor tasa de fertilidad tienen una menor esperanza de vida. A este tipo de relaci&oacute;n se le llama <em>correlaci&oacute;n</em>. &iquest;Qu&eacute; es lo que (en su caso) te indica la relaci&oacute;n entre las tasas de fertilidad y la esperanza de vida? Este patr&oacute;n en los datos se hace obvio mirando el cuadro, pero no habr&iacute;a sido obvio s&oacute;lo mirando los datos.
                </li>
                <div class="vocabFullWidth">
                    <p>&nbsp;Una<strong> correlaci&oacute;n</strong> es un tipo particular de informaci&oacute;n, es decir, una dependencia entre dos variables en una situaci&oacute;n. Por ejemplo, en la primera imagen aqu&iacute;, mientras una variable sube, la otra baja. Tambi&eacute;n es una correlaci&oacute;n cuando una variable sube o baja y la otra cambia de la misma manera.
                    </p>
                    <div class="center">
                        <div style="display: inline-grid; grid-template-columns: auto auto auto; text-align: center;">
                            <div><img class="inline" src="/bjc-r/img/5-algorithms/correlation-negative.es.png" alt="a graph with a bunch of data points, in which they generally follow a straight line from top left to bottom right" title="a graph with a bunch of data points, in which they generally follow a straight line from top left to bottom right"></div>
                            <div><img class="inline" src="/bjc-r/img/5-algorithms/correlation-positive.es.png" alt="a graph with a bunch of data points, in which they generally follow a straight line from bottom left to top right" title="a graph with a bunch of data points, in which they generally follow a straight line from bottom left to top right"></div>
                            <div><img class="inline" src="/bjc-r/img/5-algorithms/correlation-none.es.png" alt="a graph with a bunch of data points scattered all over the place, not following a line" title="a graph with a bunch of data points scattered all over the place, not following a line"></div>correlaci&oacute;n negativa correlaci&oacute;n positiva&nbsp;
                            <div>no hay correlaci&oacute;n</div>
                        </div>
                    </div>
                </div>
                <li>Inventa un escenario en el que las altas tasas de fertilidad causen una baja esperanza de vida. Luego, inventa un escenario en el que la baja esperanza de vida provoque altas tasas de fecundidad..</li>
            </ol>
        </div>
        
        <div class="vocab">
            <div class="todo">DAT-2.E.4</div>
            <p><strong>&nbsp;La visi&oacute;n</strong> es una conclusi&oacute;n significativa extra&iacute;da del an&aacute;lisis de la informaci&oacute;n.</p> 
        </div>
        <div class="todo">DAT-2.A.3, DAT-2.A.4</div>
        <p>Los datos por s&iacute; mismos no te dicen lo que causan. Puede haber una correlaci&oacute;n entre dos cosas, pero esto no significa que una cosa cause que la otra. Las personas frecuentemente dicen, "La correlaci&oacute;n no implica causalidad." Se necesita investigaci&oacute;n adicional para obtener <em>la visi&oacute;n</em> en la naturaleza exacta de la relaci&oacute;n, como la causalidad.</p>
        <div class="endnote">
            <p><a href="http://tylervigen.com/view_correlation?id=79804" title="An example of two things that are obviously correlated, but obviously neither caused the other." target="_blank">Un ejemplo de dos cosas que est&aacute;n obviamente correlacionadas, pero que obviamente ninguna de ellas caus&oacute; la otra.</a>&nbsp; Puedes dar clic en "Descubre una nueva correlaci&oacute;n" en esa p&aacute;gina para encontrar correlaciones extra&ntilde;as </p>
        </div>
        <div class="todo">DAT-2.E.3, DAT-2.E.1</div>
        <p>A menudo, una sola fuente no contiene los datos necesarios para llegar a una conclusi&oacute;n; puede ser necesario combinar datos de diversas fuentes. Como encontraste al usar el software de visualizaci&oacute;n con los datos de fertilidad y esperanza de vida, a veces un patr&oacute;n que descubres en un conjunto de datos puede plantear otra pregunta para la investigaci&oacute;n, como por ejemplo: "&iquest;Alguna de estas cosas est&aacute; correlacionada con el ingreso promedio del pa&iacute;s?" Para responder a esta pregunta, puedes encontrar una base de datos sobre econom&iacute;a, descarga algunos datos y utiliza la b&uacute;squeda de correlaciones adicionales. Puede haber varios ciclos de ver algo en los datos y recoger m&aacute;s datos para examinarlos antes de tener lo que parece ser una visi&oacute;n fiable sobre la causalidad.</p>
        
    
        <div class="forYouToDo">
			<ol start="6">
				<div class="comment">DAT-2.A</div>
                <li><img class="inline" src="/bjc-r/img/icons/write-out-thoughts-mini.es.png" alt="Escribe tus pensamientos" title="Escribe tus pensamientos"><strong>Resume tus hallazgos.</strong> Escribe uno o dos p&aacute;rrafos con tu pareja describiendo tus hallazgos sobre la esperanza de vida y la fertilidad para el pa&iacute;s que has elegido durante este per&iacute;odo de tiempo. </li>
            </ol>
        </div>

        <div class="ifTime">
			<ol start="7">
				<li>Utiliza Internet para investigar el pa&iacute;s que has elegido. Determina el probable impacto sobre la esperanza de vida y la fertilidad en este per&iacute;odo de tiempo. S&eacute; espec&iacute;fico. &iquest;Hubo una guerra en un momento en que la esperanza de vida disminuy&oacute;? &iquest;Hubo avances en la atenci&oacute;n materna en un momento en que la fertilidad aument&oacute;?</li>				   
			</ol>
		</div>
    
        <div class="endnote">
            <p><a href="#hint-jokes" data-toggle="collapse" title="Two jokes about correlation and causation from XKCD...">Dos bromas sobre la correlaci&oacute;n y la causalidad de XKCD...</a></p>
            <div id="hint-jokes" class="collapse">
                <img class="indent" src="https://es.xkcd.com/site_media/strips/correlation.es.png" alt="Comic with two people talking across three panels. In panel one, one person says 'I used to think correlation implied causation.' In panel two, the same person says, 'Then I took a statistics class. Now I don't.' In panel three, the other person says, 'Sounds like the class helped,' and the first person says, 'Well, maybe.'" title="Comic with two people talking across three panels. In panel one, one person says 'I used to think correlation implied causation.' In panel two, the same person says, 'Then I took a statistics class. Now I don't.' In panel three, the other person says, 'Sounds like the class helped,' and the first person says, 'Well, maybe.'">
                <p><a href="https://www.explainxkcd.com/wiki/index.php/552:_Correlation" title="Don't get the correlation joke about statistics class?" target="_blank">&iquest;No entendiste el chiste de la correlaci&oacute;n sobre la clase de Estad&iacute;stica?</a></p>
                <img class="indent" src="/bjc-r/img/5-algorithms/cell_phones.es.png" alt="Comic with two people talking across four panels. In panel one, the first person says 'Another huge study found no evidence that cell phones cause cancer. What was the W.H.O. thinking?' and the second person says, 'I think they just got it backward.' In panel two, the first person says, 'Huh?' and the second says, 'Well, take a look,' while holding out a laptop. Panel three shows a graph in which the 'Total cancer incidence' in the U.S. rises between 1970 and 1990 and the number of 'cell phone users' rises between 1990 and 2010. In panel four, the first person says, 'Your not... There are *so* many problems with that,' and the second person says, 'Well, just to be safe, until I see more data I'm going to assume cancer causes cell phones.'" title="">
                <p><a href="https://www.explainxkcd.com/wiki/index.php/925:_Cell_Phones" title="Don't get the correlation joke about cell phones and cancer?" target="_blank">&iquest;No entendiste la broma de la correlaci&oacute;n entre tel&eacute;fonos celulares y el c&aacute;ncer?</a></p>
            </div>
        </div>


	
</body></html>
