<!DOCTYPE html>
<html lang="es">
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8">
		
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Unidad 5 Lab 3: Transformando datos en información, Página 2</title>
	</head>

	<body>
        <h2>Autocomprobaci&oacute;n: Macrodatos</h2>
        <div class="learn">
        	<p><strong>En esta p&aacute;gina</strong>, te preparar&aacute;s para las preguntas de datos del examen AP.</p>
        </div>
        
        <div class="comment">DAT-2.C.6, DAT-2.C.7, DAT-2.C.8</div>
        <p>El tama&ntilde;o de un conjunto de datos afecta a la cantidad de informaci&oacute;n que se puede extraer de este. Los conjuntos de datos con los que trabajar&aacute;s en este curso son peque&ntilde;os comparados con los "macrodatos" utilizados para observar las tendencias en las b&uacute;squedas en Internet, la investigaci&oacute;n ambiental o la tecnolog&iacute;a financiera. Grandes conjuntos de datos (billones o trillones de entradas) son dif&iacute;ciles de procesar usando una sola computadora y pueden requerir c&oacute;mputo paralelo a trav&eacute;s de m&uacute;ltiples sistemas; la escalabilidad se convierte en un problema porque la capacidad de c&oacute;mputo de un sistema puede afectar a la forma en que los conjuntos de datos pueden ser procesados y almacenados.</p>
        
        <div class="forYouToDo" id="first">
            <ol>
				<div class="comment">DAT-2.A</div>
                <li>
                    Estas preguntas son similares a las que ver&aacute;s en el examen AP CSP.
                    <!-- Question 1 -->
                    <div class="assessment-data" type="multiplechoice" identifier="migrating birds" hasinlinefeedback="true" maxchoices="1" responseidentifier="ri1" shuffle="true">
                        <div class="prompt">
                            Los cient&iacute;ficos que estudian las aves a menudo colocan etiquetas de rastreo a las aves migratorias. Para cada ave, los siguientes datos son recolectados regularmente en intervalos frecuentes:
                            
<ul>
                                <li>Fecha y hora</li>
                                <li>Latitud y longitud</li>
                                <li>Altitud</li>
                                <li>Temperatura</li>
                            </ul>
							&iquest;Cu&aacute;l de las siguientes preguntas sobre un ave en particular <em><strong>no</strong></em> puede ser respondida utilizando <em><strong>solo</strong></em> los datos recogidos de las etiquetas de rastreo.
                        </div>
                        <div class="choice" identifier="c1">
                            <div class="text">Aproximadamente, &iquest;cu&aacute;nto tiempo pasa el p&aacute;jaro en el aire y en el suelo?</div>
                            <div class="feedback">Esto podr&iacute;a determinarse a partir de los datos de "Altitud".</div>
                        </div>
                        <div class="choice" identifier="c2">
                            <div class="text">&iquest;El p&aacute;jaro viaja en grupos con otras aves rastreadas?</div>
                            <div class="feedback">Esto podr&iacute;a determinarse a partir de los datos de "Latitud y Longitud".</div>
                        </div>
                        <div class="choice" identifier="c3">
                            <div class="text">&iquest;Se ve afectada la ruta migratoria del ave por los patrones de temperatura?</div>
                            <div class="feedback">Esto podr&iacute;a determinarse a partir de los datos de "Temperatura".</div>
                        </div>
                        <div class="choice" identifier="c4">
                            <div class="text">&iquest;Cu&aacute;les son los efectos de la contaminaci&oacute;n industrial en la ruta de migraci&oacute;n del ave?</div>
                            <div class="feedback">Correcto, no hay datos recogidos sobre la contaminaci&oacute;n en el entorno del ave.</div>
                        </div>
                        <div class="responseDeclaration" identifier="ri1">
                            <div class="correctResponse" identifier="c4"></div>
                        </div>
                    </div>                    
                                    
                    <!-- Question 2 -->
                    <div class="assessment-data" type="multiplechoice" identifier="searching for patterns" hasinlinefeedback="true" maxchoices="1" responseidentifier="ri2" shuffle="true">
                        <div class="prompt">Usando computadoras, los investigadores a menudo buscan grandes conjuntos de datos para encontrar patrones interesantes en los datos.&iquest;Cu&aacute;l de los siguientes <em><strong>no</strong></em> es un ejemplo donde la b&uacute;squeda de patrones es necesaria para reunir la informaci&oacute;n deseada?</div>
                        <div class="choice" identifier="c1">
                            <div class="text">Una empresa de compras en l&iacute;nea que analiza el historial de compras de los clientes para recomendar nuevos productos.</div>
                            <div class="feedback">Este es un ejemplo de b&uacute;squeda de patrones para reunir la informaci&oacute;n deseada.</div>
                        </div>
                        <div class="choice" identifier="c2">
                            <div class="text">Una escuela secundaria que analiza los registros de asistencia de los estudiantes para determinar qu&eacute; estudiantes deben recibir una advertencia disciplinaria.</div>
                            <div class="feedback">Correcto, aqu&iacute; no hay necesidad de an&aacute;lisis de patrones, s&oacute;lo clasificar los datos para obtener una lista de los estudiantes con inasistencia.</div>
                        </div>
                        <div class="choice" identifier="c3">
                            <div class="text">Una compa&ntilde;&iacute;a de evaluaci&oacute;n de cr&eacute;dito que analiza el historial de compras de los clientes para identificar casos de robo de identidad.</div>
                            <div class="feedback">Este es un ejemplo de b&uacute;squeda de patrones para reunir la informaci&oacute;n deseada.</div>
                        </div>
                        <div class="choice" identifier="c4">
                            <div class="text">Una universidad que analiza los resultados del GPA y el SAT de los estudiantes de secundaria para evaluar su potencial de &eacute;xito en la universidad.</div>
                            <div class="feedback">Este es un ejemplo de b&uacute;squeda de patrones para reunir la informaci&oacute;n deseada.</div>
                        </div>
                        <div class="responseDeclaration" identifier="ri2">
                            <div class="correctResponse" identifier="c2"></div>
                        </div>
                    </div>
                                    
                    <!-- Question 3 -->
                    <div class="assessment-data" type="multiplechoice" identifier="car hailing company trends" hasinlinefeedback="true" maxchoices="1" responseidentifier="ri3" shuffle="true">
                        <div class="prompt">
                            Una empresa de alquiler de coches utiliza una aplicaci&oacute;n para hacer un seguimiento de las tendencias de viaje de sus clientes. Los datos recolectados pueden ser filtrados y clasificados por <em>localizazi&oacute;n geogr&aacute;fica</em>, fecha y hora, <em>millas recorridas</em>, y <em>tarifa cobrada por el viaje</em>. &iquest;Cu&aacute;l de los siguientes es&nbsp; <em><strong>menos</strong></em> probable de ser respondido <em><strong>solamente</strong></em> con la caracter&iacute;stica de tendencias?
                        </div>
                        <div class="choice" identifier="c1">
                            <div class="text">Qu&eacute; hora del d&iacute;a es la m&aacute;s ocupada para la compa&ntilde;&iacute;a en una ciudad determinada.</div>
                            <div class="feedback">El filtrado por ubicaci&oacute;n geogr&aacute;fica y la clasificaci&oacute;n a trav&eacute;s de la informaci&oacute;n de tiempo proporcionar&iacute;a esta informaci&oacute;n.</div>
                        </div>
                        <div class="choice" identifier="c2">
                            <div class="text">Desde qu&eacute; ubicaci&oacute;n geogr&aacute;fica se originan los paseos m&aacute;s largos.</div>
                            <div class="feedback">Clasificando las millas recorridas y anotando la ubicaci&oacute;n geogr&aacute;fica se obtendr&iacute;a esta informaci&oacute;n.</div>
                        </div>
                        <div class="choice" identifier="c3">
                            <div class="text">C&oacute;mo afecta la competencia con las compa&ntilde;&iacute;as de taxis locales a los negocios en un distrito determinado.</div>
                            <div class="feedback">Correcto, no hay informaci&oacute;n sobre la competencia disponible en los datos recogidos.</div>
                        </div>
                        <div class="choice" identifier="c4">
                            <div class="text">Cu&aacute;nto dinero fue ganado por la compa&ntilde;&iacute;a en un mes determinado.</div>
                            <div class="feedback">El filtrado por fecha y la suma de las tarifas cobradas dar&iacute;an esta informaci&oacute;n.</div>
                        </div>
                        <div class="responseDeclaration" identifier="ri3">
                            <div class="correctResponse" identifier="c3"></div>
                        </div>
                    </div>
                                    
                    <!-- Question 4 -->
                    <div class="assessment-data" type="multiplechoice" identifier="information about song purchases" hasinlinefeedback="true" maxchoices="1" responseidentifier="ri4" shuffle="true">
                        <div class="prompt">
                            Una compa&ntilde;&iacute;a de descargas de m&uacute;sica en l&iacute;nea almacena informaci&oacute;n sobre las compras de canciones realizadas por sus clientes. Cada d&iacute;a, la siguiente informaci&oacute;n se hace p&uacute;blica en la base de datos del sitio web de la empresa.
                            
<ul>
                                <li>El d&iacute;a y la fecha de cada canci&oacute;n comprada.</li>
                                <li>El t&iacute;tulo de la canci&oacute;n.</li>
                                <li>Las ciudades donde los clientes compraron cada canci&oacute;n.</li>
                                <li>El n&uacute;mero de veces que cada canci&oacute;n fue comprada en una ciudad determinada.</li>
                            </ul>
                            A continuaci&oacute;n se muestra una porci&oacute;n de ejemplo de la base de datos. La base de datos est&aacute; ordenada por fecha y t&iacute;tulo de la canci&oacute;n.
                            <table class="bordered" summary="data about song downloads">
                                <tbody>
<tr>
                                    <th scope="col">D&iacute;a y fecha</th>
                                    <th scope="col">T&iacute;tulo de la canci&oacute;n</th>
                                    <th scope="col">Ciudad</th>
                                    <th scope="col">N&uacute;mero de veces que fue comprada</th>
                                </tr>
                                <tr>
                                    <td style="white-space: nowrap;">Lunes&nbsp; 07/10/17</td>
                                    <td style="white-space: nowrap;">Despacito</td>
                                    <td style="white-space: nowrap;">Boston, MA</td>
                                    <td class="center" style="white-space: nowrap;">117</td>
                                </tr>
                                <tr>
                                    <td style="white-space: nowrap;">Lunes&nbsp; 07/10/17</td>
                                    <td style="white-space: nowrap;">Malibu</td>
                                    <td style="white-space: nowrap;">Chicago, IL</td>
                                    <td class="center" style="white-space: nowrap;">53</td>
                                </tr>
                                <tr>
                                    <td style="white-space: nowrap;">Lunes&nbsp; 07/10/17</td>
                                    <td style="white-space: nowrap;">Malibu</td>
                                    <td style="white-space: nowrap;">New York, NY</td>
                                    <td class="center" style="white-space: nowrap;">197</td>
                                </tr>
                                <tr>
                                    <td style="white-space: nowrap;">Lunes&nbsp; 07/10/17</td>
                                    <td style="white-space: nowrap;">Bad Liar</td>
                                    <td style="white-space: nowrap;">Anchorage, AK</td>
                                    <td class="center" style="white-space: nowrap;">11</td>
                                </tr>
                                <tr>
                                    <td style="white-space: nowrap;">Martes 07/11/17</td>
                                    <td style="white-space: nowrap;">Despacito</td>
                                    <td style="white-space: nowrap;">San Diego, CA</td>
                                    <td class="center" style="white-space: nowrap;">241</td>
                                </tr>
                            </tbody></table>
                            &iquest;Cu&aacute;l de los siguientes <em><strong>no puede</strong></em> ser determinado utilizando sola la informaci&oacute;n en la base de datos?
                        </div>
                        <div class="choice" identifier="c1">
                            <div class="text">La canci&oacute;n que m&aacute;s se compra en una semana determinada.</div>
                            <div class="feedback">Esta informaci&oacute;n se puede encontrar sumando todas las compras de cada canci&oacute;n en una semana determinada.</div>
                        </div>
                        <div class="choice" identifier="c2">
                            <div class="text">La ciudad con menos compras en un d&iacute;a concreto.</div>
                            <div class="feedback">Esta informaci&oacute;n se puede encontrar sumando todas las compras de cada ciudad en un d&iacute;a determinado.</div>
                        </div>
                        <div class="choice" identifier="c3">
                            <div class="text">El n&uacute;mero total de ciudades en las que se compr&oacute; una determinada canci&oacute;n en un mes determinado.</div>
                            <div class="feedback">Esta informaci&oacute;n puede ser encontrada listando las ciudades para todas las compras de una canci&oacute;n en un mes determinado.</div>
                        </div>
                        <div class="choice" identifier="c4">
                            <div class="text">El n&uacute;mero total de canciones compradas por un cliente particular durante el curso de un a&ntilde;o determinado.</div>
                            <div class="feedback">Correcto, no hay datos mostrados p&uacute;blicamente sobre clientes individuales.</div>
                        </div>
                        <div class="responseDeclaration" identifier="ri4">
                            <div class="correctResponse" identifier="c4"></div>
                        </div>
                    </div>
                </li>				   
			</ol>
		</div>
        
        
	
</body></html>
