<!DOCTYPE html>
<html lang="es">
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8">
		
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Unidad 5 Lab 3: Transformando datos en información, Página 6</title>
	</head>

    <body>
        <h2>Metadatos</h2>
        <div class="learn">
            <p><strong>En esta p&aacute;gina</strong>, aprender&aacute;s acerca de <em>metadatos</em> (datos sobre datos) y como pueden ser utilizados.</p>
        </div>
                
        <div class="vocab">
            <div class="todo">DAT-2.B.1</div>
            <p><strong>Metadatos</strong> datos sobre datos. Por ejemplo, el dato puede ser una imagen, mientras que los metadatos pueden incluir la fecha de creaci&oacute;n o el tama&ntilde;o del archivo de la imagen.</p>
        </div>
        
        <div class="todo">DAT-2.B.2, DAT-2.B.3, DAT-2.B.4, DAT-2.B.5</div>
        <p>Los datos pueden incluir <em>datos sobre s&iacute; mismos</em>. Por ejemplo, un archivo de m&uacute;sica puede contener datos que describan el t&iacute;tulo de la canci&oacute;n, el artista, el &aacute;lbum, el g&eacute;nero, el sello discogr&aacute;fico, etc. O un archivo de imagen puede incluir datos de la fecha en que se tom&oacute; la foto, la ubicaci&oacute;n donde se tom&oacute;, informaci&oacute;n sobre los ajustes de la c&aacute;mara, el n&uacute;mero de serie de la c&aacute;mara espec&iacute;fica, etc. Esta clase de informaci&oacute;n acerca de los datos es llamada <strong>metadatos</strong>. Los metadatos te proporcionan informaci&oacute;n adicional sobre los datos con los que est&aacute;s trabajando y pueden utilizarse para organizar y gestionar tus datos. Por ejemplo, puedes usar metadatos para encontrar todas tus fotos de un momento y lugar determinados o para restringir el acceso a todos los v&iacute;deos grabados por tu antiguo tel&eacute;fono. Los metadatos est&aacute;n conectados pero son diferentes de tus datos y pueden ser cambiados sin afectar a los datos primarios. Por ejemplo, cambiar el nombre del &aacute;lbum de una canci&oacute;n no cambiar&aacute; el sonido de la misma.</p>
                
        <p>Debido a que los metadatos a menudo no son mostrados por el software, es f&aacute;cil violar la privacidad sin darse cuenta cuando se publican los datos en l&iacute;nea...</p>
        <p class="blockquote">"...una c&aacute;mara electr&oacute;nica no es s&oacute;lo una c&aacute;mara. Harry Potter y las Reliquias de la Muerte es, por lo que se sabe, el &uacute;ltimo libro de la serie de Harry Potter. Su llegada fue esperada con impaciencia, con filas de ansiosos fans de Harry que se extend&iacute;an alrededor de la cuadra en las librer&iacute;as de todo el mundo.Un fan consigui&oacute; una copia de pre-lanzamiento, fotografi&oacute; minuciosamente cada p&aacute;gina, y public&oacute; todo el libro en l&iacute;nea antes del lanzamiento oficial. Una acci&oacute;n bondadosa, sin duda, pero tambi&eacute;n una flagrante violaci&oacute;n a los derechos de autor. Sin duda pens&oacute; que s&oacute;lo estaba colocando los p&iacute;xeles, que no pod&iacute;an ser rastreados hasta &eacute;l. Si esa era su presunci&oacute;n, se equivoc&oacute;. <strong>Sus huellas digitales estaban por todas las im&aacute;genes.</strong> (<em>Blown to Bits</em>, p&aacute;gina 24, &eacute;nfasis agregado)</p> 
        
             
        
        <div class="forYouToDo" id="first">
			<ol>
                <div class="comment">DAT-2.B</div>
                <li>
                	Estas preguntas sobre los metadatos son similares a las que ver&aacute;s en el examen AP CSP.
                	<!-- Question 1 -->
                    <div class="assessment-data" type="multiplechoice" identifier="mobile phone recording metadata" hasinlinefeedback="true" maxchoices="1" responseidentifier="ri1" shuffle="true">
                        <div class="prompt">
                            Una nueva compa&ntilde;&iacute;a de telefon&iacute;a m&oacute;vil&mdash;sin que sus clientes lo sepan&mdash;graba peri&oacute;dicamente fragmentos aleatorios de sus conversaciones y considera las grabaciones como datos. Adem&aacute;s, recoge los siguientes metadatos de las conversaciones:
                            
<ul>
                                <li>La hora inicial y final de la conversaci&oacute;n</li>
                                <li>Los n&uacute;meros de tel&eacute;fono de los usuarios en la conversaci&oacute;n</li>
                                <li>Las ubicaciones GPS de los usuarios en la conversaci&oacute;n</li>
                            </ul>
                            <p>&iquest;Para cu&aacute;l de los siguientes objetivos ser&iacute;a m&aacute;s &uacute;til analizar los <em><strong>datos</strong></em> en lugar de los <em><strong>metadatos</strong></em>?</p>
                        </div>
                        <div class="choice" identifier="c1">
                            <div class="text">Para determinar si alguno de sus usuarios estuvo presente en el momento y lugar de un delito.</div>
                            <div class="feedback">Para este prop&oacute;sito, el GPS y la informaci&oacute;n del tiempo (en los metadatos) ser&iacute;a m&aacute;s &uacute;til.</div>
                        </div>
                        <div class="choice" identifier="c2">
                            <div class="text">Para determinar la hora del d&iacute;a, la aplicaci&oacute;n se utiliza con mayor frecuencia en una determinada ubicaci&oacute;n geogr&aacute;fica.</div>
                            <div class="feedback">Para este prop&oacute;sito, el GPS y la informaci&oacute;n del tiempo (en los metadatos) ser&iacute;a m&aacute;s &uacute;til.</div>
                        </div>
                        <div class="choice" identifier="c3">
                            <div class="text">Para determinar el lenguaje que se utiliza con mayor frecuencia en las conversaciones de los usuarios.</div>
                            <div class="feedback">Correcto. Para este prop&oacute;sito, los datos de la conversaci&oacute;n ser&iacute;an analizados.</div>
                        </div>
                        <div class="choice" identifier="c4">
                            <div class="text">Para determinar los usuarios m&aacute;s activos de la aplicaci&oacute;n en un a&ntilde;o determinado.</div>
                            <div class="feedback">Para este prop&oacute;sito, los n&uacute;meros de tel&eacute;fono de los usuarios y la informaci&oacute;n de la hora (en los metadatos) ser&iacute;an m&aacute;s &uacute;tiles.</div>
                        </div>
                        <div class="responseDeclaration" identifier="ri1">
                            <div class="correctResponse" identifier="c3"></div>
                        </div>
                    </div>
                    
                    <!-- Question 2 -->
                    <div class="assessment-data" type="multiplechoice" identifier="example of metadata" hasinlinefeedback="true" maxchoices="1" responseidentifier="ri2" shuffle="true">
                        <div class="prompt">&iquest;Cu&aacute;l de los siguientes <em><strong>no</strong></em> es un ejemplo de <em>metadatos</em>?</div>
                        <div class="choice" identifier="c1">
                            <div class="text">Los datos sobre una imagen digital describen el tama&ntilde;o de la imagen, la resoluci&oacute;n de la imagen, la profundidad del color, y cuando se cre&oacute; la imagen.</div>
                            <div class="feedback">Este es un ejemplo de datos sobre datos.</div>
                        </div>
                        <div class="choice" identifier="c2">
                            <div class="text">Los datos sobre un documento de texto que contienen informaci&oacute;n sobre la longitud del documento, su autor, la fecha en que se redact&oacute; el documento y un breve resumen del contenido.</div>
                            <div class="feedback">Este es un ejemplo de datos sobre datos.</div>
                        </div>
                        <div class="choice" identifier="c3">
                            <div class="text">Datos sobre una manada de lobos describiendo su entorno, sus h&aacute;bitos de caza, su dieta y sus ciclos de sue&ntilde;o..</div>
                            <div class="feedback">Correcto. Los datos sobre los lobos no son datos sobre datos.</div>
                        </div>
                        <div class="choice" identifier="c4">
                            <div class="text">Datos sobre una p&aacute;gina web que contenga una descripci&oacute;n del contenido de la p&aacute;gina y una lista de palabras clave vinculadas al contenido.</div>
                            <div class="feedback">Este es un ejemplo de datos sobre datos.</div>
                        </div>
                        <div class="responseDeclaration" identifier="ri2">
                            <div class="correctResponse" identifier="c3"></div>
                        </div>
                    </div>
                </li>				   
			</ol>
		</div>


	
</body></html>
