<!DOCTYPE html>
<html lang="es">
  <head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8">
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Unidad 5 Laboratorio 1: Algoritmos de búsqueda y eficiencia, Página 2</title>
	</head>

	<body>
        <h2>&iquest;Cu&aacute;ntas palabras de cinco letras hay?</h2>

        <div class="learn">
            <p><strong>En esta p&aacute;gina</strong>, ver&aacute;s cu&aacute;nto tiempo se tarda en ejecutar un algoritmo de&nbsp; <em>b&uacute;squeda lineal</em>. </p>
        </div>
        <p>En la <a href="/bjc-r/cur/programming/2-complexity/3-predicates/6-solving-word-puzzle.es.html?topic=nyc_bjc%2F2-conditionals-abstraction.es.topic&amp;course=bjc4nyc.es.html&amp;novideo&amp;noassignment" title="Unit 2 Lab 3 Page 6: Solving a Word Puzzle">Unidad 2 Laboratorio 3 P&aacute;gina 6: Resolviendo un rompecabezas de palabras</a>, construiste un bloque y lo utilizaste con <code>mantener</code> para encontrar palabras de una longitud espec&iacute;fica en una lista de palabras. &iquest;Pero cu&aacute;nto tiempo toma un proceso como este?</p>

        <div class="forYouToDo" id="first">
			<ol>
                <li><a href="/bjc-r/prog/5-algorithms/U5L1-Spell-Checker.xml" class="run"><img class="inline" src="/bjc-r/img/icons/load-save.es.png" alt="Da click aqui para cargar este archivo. Luego guárdalo en tu cuenta de Snap!." title="Da click aqui para cargar este archivo. Luego guárdalo en tu cuenta de Snap!."></a>Este proyecto provee las variables <var>1,000 palabras</var>, <var>10,000 palabras</var>, y <var>100,000 palabras</var>, cada una de ellas con una lista de palabras.</li>
				<li>&iquest;Cu&aacute;ntas palabras de cinco letras hay en una lista de <var>10,000 palabras</var>?</li>
		        <div class="endnote">El bloque <img class="inline nopadtb" src="/bjc-r/img/5-algorithms/does-word-have-number-letters.es.png" alt="does () have () letters?" title="does () have () letters?" />  est&aacute; incluido en este proyecto.</div>
                <li>Utiliza el bloque <img class="inline" src="/bjc-r/img/5-algorithms/computation-time-of.es.png" alt="computation time of 'grey ring input slot'" title="computation time of 'grey ring input slot'" />  proporcionado en este proyecto para determinar cu&aacute;nto tiempo le lleva a la computadora responder a esa pregunta.</li>
                <div class="narrower">
                    <p>El bloque <code>tiempo de ejecución computacional</code>&nbsp; toma cualquier reportador (con sus entradas completas), computa el resultado pero lo ignora, y en su lugar reporta<em> el tiempo que tom&oacute;</em> hacer el c&aacute;lculo (en milisegundos).</p>
                    <img class="indent" src="/bjc-r/img/5-algorithms/computation-time-reporting.es.png" alt="Tiempo de ejecución computacional de (n&uacute;meros de (1) a (1000)) reportando 27" title="Tiempo de ejecución computacional de (n&uacute;meros de (1) a (1000)) reportando 27">
                    <p>En este ejemplo, tom&oacute; 27 milisegundos calcular la lista de n&uacute;meros enteros del 1 al 1000. (El informe que ver&aacute;s depender&aacute; de la velocidad de tu ordenador y de los programas que se ejecuten en &eacute;l..)</p>
                    <p>Puedes ver dentro del bloque <code>tiempo de ejecución computacional</code> para ver como funciona este.</p>
                </div>
                <li>Haz clic en el bloque <code>tiempo de ejecución computacional</code> que utilizaste en la pregunta anterior tres veces m&aacute;s y nota el rango de respuestas. No son exactamente iguales debido a otras cosas que el ordenador est&aacute; haciendo al mismo tiempo, por lo que siempre debes tomar cualquier resultado que te d&eacute; como&nbsp; <em>aproximado</em>.</li>
                <li><img class="inline" src="/bjc-r/img/icons/talk-with-your-partner.es.png" alt="Habla con tu compañero" title="Habla con tu compañero">&iquest;Cu&aacute;nto tiempo crees que se tardará en contar palabras de cinco letras si la lista tuviera 100,000 palabras?</li>
                <li>Utiliza <code>tiempo de ejecución computacional</code> para determinar cu&aacute;nto tiempo se necesita para averiguar cu&aacute;ntas palabras de cinco letras hay en la lista de<var>100,000 palabras</var>. </li>
            </ol>
        </div>

		<p>La b&uacute;squeda de todas las palabras de cinco letras en una lista de palabras espec&iacute;fica es una <em>instancia</em> de un problema m&aacute;s general: la b&uacute;squeda de todas las palabras de una longitud determinada.<strong><br></strong></p>
<p><strong>Vocabulario: Problema</strong> e <strong>instancia de un problema</strong>
            </p><div class="vocabFullWidth">
<div class="comment">AAP-4.A.1</div>
            <ul>
                <li>Un <strong>problema</strong> es una descripci&oacute;n general de una tarea que puede (o no) ser resuelta algor&iacute;tmicamente.</li>
                <li>La <strong>instancia de un problema</strong> es el caso de un problema, con entradas espec&iacute;ficas.</li>
            </ul>
        </div>

        <div class="forYouToDo">
			<ol start="7">
                <li>
                    Supongamos que en lugar de eso , contamos las palabras de <em>siete</em> letras. Esto tomar&aacute;:
                    <img class="imageRight" src="/bjc-r/img/icons/write-out-thoughts.es.png" alt="Escribe tus pensamientos" title="Escribe tus pensamientos">
                    <ol>
                        <li>M&aacute;s tiempo ya que siete letras son m&aacute;s que cinco letras. </li>
                        <li>Menos tiempo porque hay menos palabras de siete letras que de cinco letras.</li>
                        <li>El mismo tiempo porque no es la longitud de la palabra lo que importa; es el tama&ntilde;o del diccionario.</li>
                    </ol>
                </li>
                <li>
                    Experimenta para averiguarlo con seguridad.
                </li>
			</ol>
		</div>
        <p>La &uacute;nica manera de responder a este problema es revisando cada una de las palabras del diccionario. Por lo tanto, si&nbsp; <strong>diez veces m&aacute;s</strong> palabras en el diccionario, toma <strong>diez veces m&aacute;s tiempo</strong> revisarlas todas. </p><strong>Vocabulario: B&uacute;squeda lineal</strong> o <strong>b&uacute;squeda secuencial</strong>
            <div class="vocabFullWidth">
<ul>
                <li>Un algoritmo toma <strong>tiempo lineal</strong> si al multiplicar el tama&ntilde;o de la entrada por diez se multiplica el tiempo requerido por diez.<br>
                <img class="indent noshadow" style="height:300px" src="/bjc-r/img/5-algorithms/size-vs-time.es.png" alt="gráfico de tamaño contra tiempo mostrando una l&iacute;nea recta a través del origen y un punto situado arriba a la derecha, con coordenadas marcadas para x=10,000 y x=100,000" title="gráfico de tamaño contra tiempo mostrando una l&iacute;nea recta a través del origen y un punto situado arriba a la derecha, con coordenadas marcadas para x=10,000 y x=100,000 marcados">
                </li>
                <div class="comment">AAP-2.O.5</div>
                <li>Un algoritmo de <strong>b&uacute;squeda lineal</strong> (o <strong>b&uacute;squeda secuencial</strong>) revisa en orden cada elemento de una lista, un proceso que toma <em>tiempo lineal</em>.</li>
            </ul>
        </div>
    </body>
</html>
