<!DOCTYPE html>
<html lang="es">
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8">

		
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Unidad 5 Laboratorio 1: Algoritmos de búsqueda y eficiencia, Página 4</title>
	</head>

	<body>
		<h2>&iquest;Exactamente cu&aacute;nto m&aacute;s r&aacute;pida es la b&uacute;squeda binaria?</h2>
        <div class="todo">
            <p>PAUL SHOULD REVIEW THIS CONTENT.</p>
            <h3>TG and solutions need to be checked. --MF, 12/19/18</h3>
        </div>
        <div class="learn">
            <p><strong>En esta p&aacute;gina</strong>, comparar&aacute;s el tiempo que se requiere para la b&uacute;squeda binaria y para la b&uacute;squeda lineal.</p>
            <div class="todo">TG: Students compare these two algorithms in two ways: empirically (with clock time) and by counting operations (steps).</div>
        </div>

        <div class="forYouToDo" id="first">
			<ol>
                <li>
                    <div class="comment">AAP-2.P.3</div>
                    Localiza el bloque <img class="inline" src="/bjc-r/img/5-algorithms/linear-search.es.png" alt="linear search for () in 'list input slot'" title="linear search for () in 'list input slot'"> incluido en tu proyecto, y mira dentro de &eacute;l. Comp&aacute;ralo con el algoritmo que usaste para contar el n&uacute;mero de palabras de cinco o siete letras. Este bloque hace el mismo c&aacute;lculo que el bloque de b&uacute;squeda binaria,&nbsp; pero utiliza el algoritmo lineal.
                </li>
                <li>
                    Utiliza <img class="inline" src="/bjc-r/img/5-algorithms/computation-time-of.es.png" alt="computation time of 'grey ring input slot'" title="computation time of 'grey ring input slot'">para probar cu&aacute;nto tiempo le toma a la <code>b&uacute;squeda lineal</code> encontrar la palabra "zumo" en cada lista.
                    

<table class="bordered center standard" summary="partially blank table showing the time to run LINEAR SEARCH for lists of different lengths">
                        <tbody>
<tr>
                            <th scope="col">Longitud de la lista</th>
                            <th scope="col">Tiempo de la<span style="font-family: monospace;"> </span><code>b&uacute;squeda lineal</code> </th>
                        </tr>
                        <tr>
                            <td>1000</td>
                            <td><br></td>
                        </tr>
                        <tr>
                            <td>10,000</td>
                            <td><br></td>
                        </tr>
                        <tr>
                            <td>100,000</td>
                            <td><br></td>
                        </tr>
                    </tbody></table>
                </li>
                <li><img class="inline" src="/bjc-r/img/icons/talk-with-your-partner.es.png" alt="Habla con tu compañero" title="Habla con tu compañero"> Mira la tabla. &iquest;C&oacute;mo describir&iacute;as lo que sucede con el tiempo a medida que la entrada se hace m&aacute;s grande?</li>
            </ol>
        </div>
        <p>
            La cantidad actual de tiempo f&iacute;sico que se necesita para resolver un problema depende no s&oacute;lo de tu algoritmo, sino tambi&eacute;n de la velocidad de tu ordenador y de qu&eacute; otros programas tienes en ejecuci&oacute;n, etc. Por lo tanto, los inform&aacute;ticos que quieren medir la velocidad de un algoritmo lo hacen en t&eacute;rminos del n&uacute;mero de <em>pasos</em>. Por ejemplo, lo qu&eacute; realmente queremos saber sobre la eficiencia del algoritmo de <code>b&uacute;squeda lineal</code> es c&uacute;antas veces el <var>art&iacute;culo actual</var> es comparado al&nbsp; <var>valor</var> (es decir, cu&aacute;ntas veces <img class="inline nopadtb" src="/bjc-r/img/5-algorithms/current-item=value.es.png" alt="(current item) = (value)" title="(current item) = (value)"> es llamado).
        </p>
        <div class="forYouToDo">
			<ol start="4">
                <li>
                    <div class="comment">AAP-2.P.3</div>
                    A&ntilde;ade otra columna a tu tabla. Asumiendo que "zumo" es la <em>&uacute;ltima palabra</em> en cada lista de palabras, &iquest;cu&aacute;ntas comparaciones son hechas por el algoritmo de <code>b&uacute;squeda lineal</code> para cada lista?
                    

<table class="bordered center standard" summary="partially blank table showing the time and now also steps to run LINEAR SEARCH for lists of different lengths">
                        <tbody>
<tr>
                            <th scope="col" style="white-space: nowrap;">Longitud de la lista</th>
                            <th scope="col">Tiempo de la<span style="font-family: monospace;"> </span><code>b&uacute;squeda lineal</code></th>
                            <th scope="col" style="white-space: nowrap;">Pasos de la <span style="font-family: monospace;">b&uacute;squeda lineal</span><code></code></th>
                        </tr>
                        <tr>
                            <td>1000</td>
                            <td><br></td>
                            <td><br></td>
                        </tr>
                        <tr>
                            <td>10,000</td>
                            <td><br></td>
                            <td><br></td>
                        </tr>
                        <tr>
                            <td>100,000</td>
                            <td><br></td>
                            <td><br></td>
                        </tr>
                    </tbody></table>
                </li>
                <li><img class="imageRight" src="/bjc-r/img/icons/talk-with-your-partner.es.png" alt="Habla con tu compañero" title="Habla con tu compañero"> &iquest;C&oacute;mo describir&iacute;as lo que sucede con el n&uacute;mero de <em>pasos</em> a medida que la lista de entradas se hace m&aacute;s grande? Escribe tu hip&oacute;tesis sobre este patr&oacute;n.</li>
                <li>&iquest;Lo que sucede con los pasos coincide con lo que sucede con el tiempo? Es decir, &iquest;puedes contar los pasos como una medida de tiempo?</li>
            </ol>
        </div>
        <div class="vocabFullWidth">
            <div class="comment">AAP-4.A.3</div>
            <p>La relaci&oacute;n entre el tama&ntilde;o de la entrada y el n&uacute;mero de pasos requeridos para resolver un problema es la <strong>eficiencia</strong> del algoritmo utilizado para resolver el problema.</p>
        </div>
        <div class="comment">AAP-4.A.4, AAP-4.A.5</div>
        <p>Contando el n&uacute;mero de pasos, como lo acabas de hacer, es <em>informal</em>, pero es una buena forma de determinar la eficiencia de un algoritmo.&nbsp; La medici&oacute;n <em>formal</em>&nbsp;de un algoritmo requiere de una prueba matem&aacute;tica.</p>
        
        <div class="takeNote">En este curso, la mayor&iacute;a de las veces est&aacute;s trabajando con problemas peque&ntilde;os, por lo que no importa lo eficiente que sea el algoritmo. Pero en el mundo real, los programadores se ocupan de listas de miles de millones de elementos, por lo que la eficiencia de un algoritmo puede marcar una gran diferencia. </div>
        
        <div class="forYouToDo">
            <ol start="7">
                <li>
                	<div class="comment">AAP-2.P part a</div>
                    <div class="comment">AAP-2.P.3</div>
                    Ahora, prueba cu&aacute;nto tiempo le toma a la <code>b&uacute;squeda binaria </code>encontrar la palabra "zumo" en las listas <em>clasificadas</em>, y determina cu&aacute;ntas comparasiones por el algoritmo si "zumo" es la &uacute;ltima palabra en cada lista.
                    

<table class="bordered center standard" summary="partially blank table showing the time and now also steps to run LINEAR SEARCH for lists of different lengths">
                        <tbody>
<tr>
                            <th scope="col">Longitud de la lista</th>
                            <th scope="col">Tiempo de la<span style="font-family: monospace;"> </span><code>b&uacute;squeda lineal</code></th>
                            <th scope="col">Pasos de la <span style="font-family: monospace;">b&uacute;squeda lineal</span><code></code></th>
                        </tr>
                        <tr>
                            <td>1000</td>
                            <td><br></td>
                            <td><br></td>
                        </tr>
                        <tr>
                            <td>10,000</td>
                            <td><br></td>
                            <td><br></td>
                        </tr>
                        <tr>
                            <td>100,000</td>
                            <td><br></td>
                            <td><br></td>
                        </tr>
                    </tbody></table>
                </li>
                <li><img class="inline" src="/bjc-r/img/icons/talk-with-your-partner.es.png" alt="Habla con tu compañero" title="Habla con tu compañero">Describe lo que sucede con el tiempo y el n&uacute;mero de pasos a medida que la lista de entradas se hace m&aacute;s grande. Escribe tu hip&oacute;tesis.</li>
                <li>
                	<div class="comment">AAP-2.P.3, AAP-4.A.6</div>
                	Mira de nuevo tus tablas de algoritmos para la<code><span style="font-family: serif;"> </span>b&uacute;squeda lineal </code>y la&nbsp; <code>b&uacute;squeda binaria</code>, y compara los dos algoritmos de b&uacute;squeda:
                    

<ol>
                        <li>&iquest;C&uacute;al tiene m&aacute;s bloques en su c&oacute;digo?</li>
                        <li>&iquest;Cu&aacute;l se ejecuta m&aacute;s r&aacute;pido para grandes entradas?</li>
                        <li>&iquest;Qu&eacute; algoritmo es m&aacute;s eficiente?</li>
                    </ol>
                </li>
                <li>
                    <div class="comment">AAP-2.P part b</div>
                    <img class="inline" src="/bjc-r/img/icons/write-out-thoughts.es.png" alt="Escribe tus pensamientos" title="Escribe tus pensamientos">
                    &iquest;Cu&aacute;les son los dos requerimientos para utilizar la b&uacute;squeda binaria?
                </li>
            </ol>
        </div>
</body></html>
