<!DOCTYPE html>
<html lang="en">
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8">
		
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Unidad 5 Laboratorio 1: Algoritmos de búsqueda y eficiencia, Página 8</title>
    </head>

	
    <body>
		<h2>Paralelismo</h2>
        <div class="learn">
            <p><strong>En esta p&aacute;gina,</strong> aprender&aacute;s c&oacute;mo la ejecuci&oacute;n de m&uacute;ltiples scripts en paralelo puede reducir el tiempo total que se tarda en ejecutar un algoritmo.</p>
        </div>
        <p>En Snap<em>!</em>, est&aacute;s acostumbrado a ver un mont&oacute;n de scripts que se ejecutan de forma independiente, que pueden o no estar asociados con diferentes sprites. Esto es una especie de <em>computaci&oacute;n en paralelo</em>. As&iacute; que, si tuvi&eacute;ramos un ordenador diferente para cada sprite, eso ser&iacute;a el verdadero paralelismo. Tal como es, s&oacute;lo hay un ordenador, y divide su atenci&oacute;n entre los procesos ejecutando un poco de uno y luego ejecutando un poco del siguiente. Espec&iacute;ficamente, cambia en la parte inferior de los bucles (<code>por siempre</code>, <code>repetir</code>, etc.).</p><strong>Vocabulario: Computaci&oacute;n secuencial y paralela</strong> <strong></strong>
            <div class="vocabFullWidth">
<div class="comment">CSN-2.A.1, CSN-2.A.2</div>
            <p>&nbsp;
                Esta secci&oacute;n cubre dos modelos de computaci&oacute;n:
                </p>
<ul>
                    <li>En <strong>computaci&oacute;n secuencial</strong>, las operaciones se realizan en orden de una en una..</li>
                    <li>En <strong>computaci&oacute;n en paralelo</strong>, el programa se divide en pasos m&aacute;s peque&ntilde;os, algunos de los cuales se realizan al mismo tiempo. Las computadoras modernas tienen m&uacute;ltiples procesadores (2, 4, u 8) en una sola computadora, para que puedas hacer un procesamiento paralelo a peque&ntilde;a escala en la m&aacute;quina de tu escritorio.</li>
                </ul>
            <p></p>
        </div>
        
        <div class="comment">CSN-2.A.4</div>
        <p>Puedes comparar la eficiencia de dos soluciones algor&iacute;tmicas diferentes a un problema comparando el tiempo que les lleva realizar la misma tarea.</p>
        
        <div class="forYouToDo" id="first">
			<ol>
                <li>
                    <!-- Question 1 -->
                    <div class="assessment-data" type="multiplechoice" identifier="How long will this sequential script take to run?" hasinlinefeedback="true" maxchoices="1" responseidentifier="ri1" shuffle="true">
                        <div class="prompt">
                            <div class="comment">CSN-2.A part b, CSN-2.A.5</div>
                            &iquest;Cu&aacute;nto tiempo tardar&aacute; este programa <em>secuencial</em> en ejecutarse?<br>
                            <img class="indent" src="/bjc-r/img/5-algorithms/quizlet-sequential.es.png" alt="wait (6), wait (4), wait (8)" title="wait (6), wait (4), wait (8)">
                        </div></div></li><li>
<div class="assessment-data" type="multiplechoice" identifier="How long will this sequential script take to run?" hasinlinefeedback="true" maxchoices="1" responseidentifier="ri1" shuffle="true">
                        <div class="choice" identifier="c1">
                            <div class="text">18</div>
                            <div class="feedback">&iexcl;Correcto!</div>
                        </div>
                        <div class="choice" identifier="c2">
                            <div class="text">8</div>
                            <div class="feedback">Una soluci&oacute;n secuencial toma tanto tiempo como la suma de los tiempos de ejecuci&oacute;n de todos sus pasos.</div>
                        </div>
                        <div class="choice" identifier="c3">
                            <div class="text">4</div>
                            <div class="feedback">Una soluci&oacute;n secuencial toma tanto tiempo como la suma de los tiempos de ejecuci&oacute;n de todos sus pasos.</div>
                        </div>
                        <div class="choice" identifier="c4">
                            <div class="text">6</div>
                            <div class="feedback">Una soluci&oacute;n secuencial toma tanto tiempo como la suma de los tiempos de ejecuci&oacute;n de todos sus pasos.</div>
                        </div>
                        <div class="responseDeclaration" identifier="ri1">
                            <div class="correctResponse" identifier="c1"></div>
                        </div>
                    </div>
                </li>
            </ol>
        </div>
    
        <div class="comment">CSN-2.A.5</div>
        <p>El tiempo de ejecuci&oacute;n de un algoritmo secuencial es la suma de los tiempos de ejecuci&oacute;n de todos sus pasos.</p>
    
        <div class="forYouToDo">
			<ol start="2">
				<li>
                    <!-- Question 2 -->
                    <div class="assessment-data" type="multiplechoice" identifier="How long will this parallel script take to run?" hasinlinefeedback="true" maxchoices="1" responseidentifier="ri2" shuffle="true">
                  <div class="prompt">
                            <div class="comment">CSN-2.A part b, CSN-2.A.6</div>
                            &iquest;Cu&aacute;nto tiempo tardar&aacute; este programa <em>paralelo</em> en ejecutarse?<br>
                            <img class="indent" src="/bjc-r/img/5-algorithms/quizlet-parallel-1.es.png" alt="broadcast (go) and wait, wait (6) secs" title="broadcast (go) and wait, wait (6) secs">
                            <img class="indent" src="/bjc-r/img/5-algorithms/quizlet-parallel-2.es.png" alt="when I receive (go): wait (4) secs" title="when I receive (go): wait (4) secs">
                            <img class="indent" src="/bjc-r/img/5-algorithms/quizlet-parallel-3.es.png" alt="when I receive (go): wait (8) secs" title="when I receive (go): wait (8) secs">
                    </div>
                        <div class="choice" identifier="c1">
                            <div class="text">18</div>
                            <div class="feedback">
                                Las dos tareas <code>cuando yo recibo</code> ocurren en paralelo, no una despu&eacute;s de la otra.
                            </div>
                        </div>
                        <div class="choice" identifier="c2">
                            <div class="text">8</div>
                            <div class="feedback">
                                El tiempo paralelo m&aacute;s largo importa, pero no es lo &uacute;nico que contribuye al tiempo total.
                            </div>
                        </div>
                        <div class="choice" identifier="c3">
                            <div class="text">6</div>
                            <div class="feedback">
                                <code>Transmitir y esperar</code>&nbsp; hasta que todas las tareas que comenzaron han terminado.
                            </div>
                        </div>
                        <div class="choice" identifier="c4">
                            <div class="text">14</div>
                            <div class="feedback">
                                &iexcl;Correcto!
                            </div>
                        </div>
                        <div class="responseDeclaration" identifier="ri2">
                            <div class="correctResponse" identifier="c4"></div>
                        </div>
                    </div>
                </li>
			</ol>
		</div>
    
        <div class="comment">CSN-2.B.1, CSN-2.B.2, CSN-2.B.3, CSN-2.B.4</div>
        <div class="vocabBig">
            <div class="todo">CSN-2.A.3</div>
            <p><strong>Computaci&oacute;n distribuida </strong>es una forma de computaci&oacute;n paralela que utiliza m&uacute;ltiples computadoras (tal vez incluso se extienda por todo el mundo).</p>
        </div>
        <p>Escribir un programa que no hace nada m&aacute;s que esperar es, por supuesto, poco realista, pero lo que <em>es</em> real&iacute;stico es que en la mayor&iacute;a de los problemas, no hay una soluci&oacute;n que sea puramente paralela. Alguna parte de la computaci&oacute;n tiene que hacerse de forma secuencial. En la pregunta previa,&nbsp; la parte secuencial es modelada por <code>esperar 6 segs</code>. El paralelismo con este tonto ejemplo se siente trivial, pero imagina que trabajas para Google. Millones de consultas de b&uacute;squeda y ediciones de p&aacute;ginas web han ocurrido hoy en d&iacute;a, y es tu trabajo tener que procesarlos. Si no tuvieran enormes instalaciones de servidores con miles de computadoras en cada edificio, no podr&iacute;an seguir el ritmo en absoluto. La inform&aacute;tica distribuida te permite <em>escalar</em> a problemas muy grandes.</p>
        <div class="comment">CSN-2.A.6</div>
        <p>
            <img class="noshadow imageRight" src="/bjc-r/img/5-algorithms/sequential-parallel-parts.es.png" alt="diagram of algorithm for finding the average word length in list of 100,000 words: the first two steps (Divide up the wordlist, Send tasks to each other computer) are labeled 'sequential'; then arrows indicate branching off into multiple tasks (Count all the 'A' words, Count all the 'B' words, ..., Count all the 'Z' words) that are labeled 'parallel'; finally, arrows indicate rejoining these results back into a single thread of three steps (Add the 26 partial results, Divide that sum by the total number of words, Report that average) labeled 'sequential'" title="diagram of algorithm for finding the average word length in list of 100,000 words: the first two steps (Divide up the wordlist, Send tasks to each other computer) are labeled 'sequential'; then arrows indicate branching off into multiple tasks (Count all the 'A' words, Count all the 'B' words, ..., Count all the 'Z' words) that are labeled 'parallel'; finally, arrows indicate rejoining these results back into a single thread of three steps (Add the 26 partial results, Divide that sum by the total number of words, Report that average) labeled 'sequential'" style="background: white;">Como un ejemplo m&aacute;s espec&iacute;fico, supongamos que quieres saber la longitud media de las palabras de una lista de 100.000 palabras. Puedes dividir la tarea entre varios ordenadores (uno para cada letra de inicio). Cada computadora suma las longitudes de todas las palabras que se le asignan (todas las palabras "A", todas las palabras "B", etc). Luego una computadora tiene que sumar los 26 resultados parciales y dividirlos por el n&uacute;mero total de palabras para encontrar el promedio. Para calcular el tiempo de ejecuci&oacute;n de esta soluci&oacute;n paralela, a&ntilde;adir&iacute;as el tiempo de ejecuci&oacute;n de la parte paralela m&aacute;s larga (el tiempo de ejecuci&oacute;n de la letra con m&aacute;s palabras) al tiempo de ejecuci&oacute;n de la parte secuencial (sumando los 26 resultados parciales y dividiendo la suma por el n&uacute;mero total de palabras).
        </p>
    
        
        <div class="forYouToDo" style="clear: right;">
            <p>Debido a que cada c&oacute;mputo incluye una porci&oacute;n secuencial, hay un l&iacute;mite de cu&aacute;nto puede acelerar una tarea al agregar <em>procesadores</em>.</p>
            <div class="vocab">
                <p>Un <strong>procesador</strong> es una pieza de circuitos dentro de una computadora que procesa las instrucciones de los programas de computaci&oacute;n.</p> 
                <p class="center"><img src="/bjc-r/img/6-computers/Hardware_img/CPU_small.jpg" alt="CPU" title="CPU"></p>
                <p><small>Cr&eacute;ditos de la imagen: Wikipedia usuario Solipsist</small></p>
            </div>
			<ol start="3">
                <div class="comment">CSN-2.A parts a and b, CSN-2.A.4, CSN-2.B.5</div>
				<li>
                    Supongamos que una tarea incluye un minuto de pasos secuenciales y una porci&oacute;n paralelizable que tomar&iacute;a una hora si se hace de manera secuencial. Completa esta tabla:
                    
<table class="bordered standard nowrap center" summary="Table of number of processors vs. total program running time">
                        <tbody>
<tr>
                            <th scope="col">N&uacute;mero de procesadores</th>
                            <th scope="col">Tiempo total requerido</th>
                            <th scope="col">Tipo de soluci&oacute;n</th>
                        </tr>
                        <tr>
                            <td>1</td>
                            <td>61 minutos (1 hr + 1 min)</td>
                            <td>soluci&oacute;n secuencial</td>
                        </tr>
                        <tr>
                            <td>2</td>
                            <td>31 minutos (30 min + 1 min)</td>
                            <td rowspan="10">soluciones paralelas</td>
                        </tr>
                        <tr>
                            <td>3</td>
                            <td><br></td>
                        </tr>
                        <tr>
                            <td>4</td>
                            <td><br></td>
                        </tr>
                        <tr>
                            <td>10</td>
                            <td><br></td>
                        </tr>
                        <tr>
                            <td>20</td>
                            <td><br></td>
                        </tr>
                        <tr>
                            <td>30</td>
                            <td><br></td>
                        </tr>
                        <tr>
                            <td>60</td>
                            <td><br></td>
                        </tr>
                        <tr>
                            <td>120</td>
                            <td><br></td>
                        </tr>
                        <tr>
                            <td>240</td>
                            <td><br></td>
                        </tr>
                        <tr>
                            <td>480</td>
                            <td><br></td>
                        </tr>
                    </tbody></table>
                </li>
                <div class="comment">CSN-2.B.5</div>
                <li>Considere la ley de los rendimientos decrecientes:
                    
<ol>
                        <li>Si tienes un procesador y a&ntilde;ades uno m&aacute;s, &iquest;cu&aacute;nto tiempo te ahorras?</li>
                        <li>Si tienes 240 procesadores y a&ntilde;ades 240 m&aacute;s, &iquest;cu&aacute;nto tiempo te ahorras?</li>
                        <li><img class="inline" src="/bjc-r/img/icons/talk-with-your-partner.es.png" alt="Habla con tu compañero" title="Habla con tu compañero">&iquest;Cu&aacute;ntos procesadores crees que vale la pena tener para este problema?</li>
                    </ol>
                </li>
                <div class="endnote">
                    <a href="#hint-diminishing" data-toggle="collapse" title="What is the law of diminishing returns?">&iquest;Qu&eacute; es la ley de rendimientos decrecientes?</a>
                    <div id="hint-diminishing" class="collapse">La ley de los rendimientos decrecientes es una idea de la econom&iacute;a que b&aacute;sicamente dice que despu&eacute;s de cierto punto, m&aacute;s no es mejor. Por ejemplo, si recibiste cinco regalos de cumplea&ntilde;os, puede que seas m&aacute;s feliz que si s&oacute;lo recibiste uno, pero recibir m&aacute;s regalos no es necesariamente mejor. Imagina que recibes cien regalos. Te aburrir&iacute;as abri&eacute;ndolos y probablemente te sentir&iacute;as abrumado. Y recibir mil o un mill&oacute;n de regalos no har&iacute;a m&aacute;s feliz tu cumplea&ntilde;os. La misma regla al &iexcl;pastel de cumplea&ntilde;os!</div>
                </div>
			</ol>
		</div>
		
        <div class="vocabFullWidth">
            <div class="comment">CSN-2.A.7</div>
            <p>
                Los programadores se refieren a la <strong>aceleraci&oacute;n</strong> de la soluci&oacute;n paralela para describir cu&aacute;ntas veces m&aacute;s r&aacute;pido se compara la soluci&oacute;n paralela con la soluci&oacute;n secuencial:<br>
            <span class="katex indent">\text{aceleraci&oacute;n} = \frac{\text{tiempo secuencial}}{\text{tiemo paralelo}}</span>
            </p>
        </div>
    
        <p>El hardware del ordenador es muy fiable;es raro que el hardware se aver&iacute;e mientras est&aacute;s ejecutando un programa. Pero en la computaci&oacute;n distribuida con decenas de miles de ordenadores trabajando en el mismo problema, es <em>probable</em> que uno de ellos falle. (Si la probabilidad de que un ordenador falle durante la ejecuci&oacute;n de un programa es de 0,0001, y utilizas 10.000 ordenadores, entonces la probabilidad de que uno de ellos falle es de alrededor de 0,368, aproximadamente &iexcl;un tercio de las veces!) Por lo tanto, el software tiene que compensar comprobando que las m&aacute;quinas est&aacute;n funcionando y reasignando las tareas de un ordenador que ha fallado a uno que funciona.</p>
        <p>Adem&aacute;s, cuando se hacen las cosas en paralelo, los procesos paralelos pueden interferir entre s&iacute;.
            </p>
<div class="endnote">
                <a href="#hint-banking" data-toggle="collapse" title="An example of interfering processes with banking...">Un ejemplo de interferencia de procesos con la banca...</a>
                <div id="hint-banking" class="collapse">
                    <p>
                        Si una persona retira dinero de un cajero autom&aacute;tico al mismo tiempo que otra persona en un cajero autom&aacute;tico diferente retira dinero de la misma cuenta, podr&iacute;as encontrarte con una situaci&oacute;n como la siguiente:
                        </p>
<table class="bordered standard nowrap center" summary="Possible sequence of events when two ATM transactions happen in parallel">
                        <tbody>
<tr>
                            <td rowspan="9" style="vertical-align: middle; border-left: 0; border-top: 0; border-bottom: 0;"><img class="inline noshadow" src="/bjc-r/img/5-algorithms/time-arrow.es.png" alt="downward pointing arrow labeled 'time'" title="downward pointing arrow labeled 'time'"></td>
                            <th scope="col">Cajero autom&aacute;tico 1</th>
                            <th scope="col">Cajero autom&aacute;tico 2</th>
                        </tr>
                        <tr>
                            <td>Busca el saldo ($100)</td>
                            <td><br></td>
                        </tr>
                        <tr>
                            <td><br></td>
                            <td>Busca el saldo ($100)</td>
                        </tr>
                        <tr>
                            <td><br></td>
                            <td>Revisa si la cantidad requerida ($40) est&aacute; disponible</td>
                        </tr>
                        <tr>
                            <td><br></td>
                            <td>Ajusta el saldo ($60)</td>
                        </tr>
                        <tr>
                            <td><br></td>
                            <td>Reparte el dinero</td>
                        </tr>
                        <tr>
                            <td>Revisa si la catnidad requerida ($20) est&aacute; disponible</td>
                            <td><br></td>
                        </tr>
                        <tr>
                            <td>Ajusta el saldo ($80)</td>
                            <td><br></td>
                        </tr>
                        <tr>
                            <td>Reparte el dinero</td>
                            <td><br></td>
                        </tr>
                    </tbody></table>
                    <p></p>
                    <p>Debido a que el cajero autom&aacute;tico 2 cambi&oacute; el saldo de la cuenta despu&eacute;s de que el cajero autom&aacute;tico 1 busc&oacute; el saldo, el cajero autom&aacute;tico 1 no sab&iacute;a que el saldo hab&iacute;a sido cambiado. La cuenta bancaria termin&oacute; con un saldo de 80 d&oacute;lares, aunque empez&oacute; con 100 d&oacute;lares y se retir&oacute; un total de 60 d&oacute;lares.</p>
                </div>
            </div>
        <p></p>
        <p>Por estas y otras razones, un programa paralelo es m&aacute;s dif&iacute;cil de escribir y depurar que un programa secuencial.</p>

    
        <div class="forYouToDo">
			<ol start="5">
				<div class="comment">CSN-2.B</div>
                <li>
                    <img class="inline" src="/bjc-r/img/icons/talk-with-your-partner.es.png" alt="Habla con tu compañero" title="Habla con tu compañero"> Identifica algunos beneficios y desaf&iacute;os potenciales de la computaci&oacute;n paralela y distribuida.
                    <img class="inline" src="/bjc-r/img/icons/write-out-thoughts.es.png" alt="Escribe tus pensamientos" title="Escribe tus pensamientos">
                </li>
			</ol>
		</div>

        <div class="ifTime">
			<ol start="6">
				<li>
                    <!-- Question 3 -->
                    <div class="assessment-data" type="multiplechoice" identifier="What is the speedup for this parallel solution when compared to the sequential solution?" hasinlinefeedback="true" maxchoices="1" responseidentifier="ri3" shuffle="true">
                        <div class="prompt">
                            &iquest;Cu&aacute;l es la <em>aceleraci&oacute;n</em> para esta soluci&oacute;n paralela en comparaci&oacute;n con la soluci&oacute;n secuencial?<br>
                            <ul>
                                <li>Soluci&oacute;n secuencial: <img class="inline" src="/bjc-r/img/5-algorithms/quizlet-sequential.es.png" alt="wait (6), wait (4), wait (8)" title="wait (6), wait (4), wait (8)"></li>
                                <li>
                                    Soluci&oacute;n paralela:
                                    <img class="inline" src="/bjc-r/img/5-algorithms/quizlet-parallel-1.es.png" alt="broadcast (go) and wait, wait (6) secs" title="broadcast (go) and wait, wait (6) secs">
                                    <img class="inline" src="/bjc-r/img/5-algorithms/quizlet-parallel-2.es.png" alt="when I receive (go): wait (4) secs" title="when I receive (go): wait (4) secs">
                                    <img class="inline" src="/bjc-r/img/5-algorithms/quizlet-parallel-3.es.png" alt="when I receive (go): wait (8) secs" title="when I receive (go): wait (8) secs">
                                </li>
                            </ul>
                        </div>
                        <div class="choice" identifier="c1">
                            <div class="text"><span class="katex">\frac{18}{14}</span></div>
                            <div class="feedback">
                                &iexcl;Correcto!
                            </div>
                        </div>
                        <div class="choice" identifier="c2">
                            <div class="text"><span class="katex">\frac{14}{18}</span></div>
                            <div class="feedback">
                                La aceleraci&oacute;n se calcula dividiendo el tiempo secuencial por el tiempo paralelo.
                            </div>
                        </div>
                        <div class="choice" identifier="c3">
                            <div class="text"><span class="katex">\frac{18}{6}</span></div>
                            <div class="feedback">
                                <code>Transmitir y esperar</code> espera hasta que todas las tareas que comenz&oacute; han terminado.
                            </div>
                        </div>
                        <div class="choice" identifier="c4">
                            <div class="text"><span class="katex">\frac{18}{8}</span></div>
                            <div class="feedback">
                                El tiempo paralelo m&aacute;s largo s&iacute; importa, pero no es lo &uacute;nico que contribuye al tiempo paralelo total.
                            </div>
                        </div>
                        <div class="responseDeclaration" identifier="ri3">
                            <div class="correctResponse" identifier="c1"></div>
                        </div>
                    </div>
                </li>
			</ol>
		</div>
        
        
    
</body></html>