<!DOCTYPE html>
<html lang="es">
    <head>
        <meta http-equiv="content-type" content="text/html; charset=utf-8" />
        <script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Unidad 6 Laboratorio 2: Historia e impacto de las computadoras, p&aacute;gina 2</title>
    </head>
    <body>
        <h2>Ley de Moore</h2>
        <div class="todo">
            <p>MF: lightly clean up to make the text more concise</p>
        </div>
        
        <div class="learn"><strong>En esta p&aacute;</strong>, usted aprender&aacute; que la velocidad de un procesador de computadora y el tamaño de la memoria se han duplicado cada uno o dos años, durante m&aacute;s de 50 años.</div>
        <img class="imageRight noshadow" src="/bjc-r/img/6-computers/mooreslaw_graph.es.png" alt="Gr&aacute;fica del n&uacute;mero de transistores en un procesador incrementando exponencialmente de 0 a 20 mil millones entre los años 1971 a 2017" title="Gr&aacute;fica del n&uacute;mero de transistores en un procesador incrementando exponencialmente de 0 a 20 mil millones entre los años 1971 a 2017"/>
		<p>En 1965, Gordon Moore, uno de los pioneros en los circuitos integrados predijo que el <strong>n&uacute;mero de transistores</strong> que eran capaces de instalarse en un chip de un tamaño dado se duplicar&iacute;a cada año. En 1975, &eacute;l volvió a realizar su estimado, indicando que la cantidad se duplicar&iacute;a cada dos años. Esta predicción se conoce como <strong>La ley de Moore.</strong></p>
        <div class="comment">5.2.1K Improvements in algorithms, hardware, and software increase the kinds of problems and the size of problems solvable by programming. </div>
        <p>Resulta que otras m&eacute;tricas tambi&eacute;n muestran aproximadamente el mismo comportamiento de duplicarse en capacidad, tales como las velocidades de los procesadores y el tamaño de almacenamiento que cabe en una computadora. Duplicar la velocidad del hardware mejora el tamaño de los problemas que se pueden manejar eficientemente.</p>
        <p>La importancia de la Ley de Moore no es solo que las computadoras se agranden y sean m&aacute;s r&aacute;pidas en el tiempo; es que los ingenieros pueden predecir <em>qu&eacute; tan</em> grande y r&aacute;pido, lo cu&aacute;l ayuda a los ingenieros planificar el software y hardware en los proyectos de desarrollo que empiezan hoy y se utilizar&aacute;n incluso dentro de cinco años.</p>
        
        <div class="ifTime">
            <ol>
                <li>
		   Un servidor de computadora de escritorio de 2017 (no una computadora de un solo usuario) tiene hasta 3 TB de memoria (3 mil millones de MB). ¿La predicción de duplicar cada dos años es válida para estas dos máquinas?
¿Cuántos años de diferencia se hicieron?
Si la capacidad de memoria se duplicó cada dos años durante ese tiempo, ¿aproximadamente por qué número debería multiplicar el enorme 1MB de la computadora para predecir el tamaño de la memoria en 2017?


                    Esa enorme computadora que viste en el Laboratorio 1 fue construida en 1975 y tenía aproximadamente 1 MB de memoria. Un <em>servidor</em> tamaño de escritorio del 2017 (no una computadora de escritorio) tiene hasta 3TB de memoria (3 mil millones de MB). ¿La predicción de duplicar cada dos años es válida para estas dos máquinas?
                    <ol>
                        <li>¿Cuántos años de diferencia transcurrieron?</li>
                        <li>Si la capacidad de memoria se duplicó cada dos años durante ese tiempo, ¿aproximadamente por qué número debería multiplicar el enorme 1MB de la computadora para predecir el tamaño de la memoria en 2017?</li>
                        <li>¿3 TB es más o menos de lo que esperabas?</li>
                    </ol>
                </li>
            </ol>
        </div>
        
        <h3>Limitaciones a la Ley de Moore</h3>
        <img class="imageRight" src="/bjc-r/img/6-computers/heatsink.es.png" height="200px" alt="disipador de calor" title="disipador de calor" />
        <p>Para que la cantidad de transistores contin&uacute;e creciendo, el tamaño de los transistores debe seguir disminuyendo. Pero la densidad de los chips y velocidad de procesador se han topado con un l&iacute;mite importante: Ambos factores, chips densos y proceso de señales más rápidas generan <em>calor</em>. La tecnología actual está justo al borde de generar calor suficiente para  derretir chips, destruyendo la computadora. Esta es la raz&oacute;n por la cu&aacute;l los chips est&aacute;n rodeados de &lt;em&gt;disipadores de calor&lt;/em&gt; met&aacute;licos (mostrado a la derecha), los cuales conducen el calor afuera del chip y lo liberan al aire.</p>
        <div class="takeItFurther">
            <ol type="A">
                <li>Los disipadores de calor no son bloques s&oacute;lidos de metal; tienen picos y zigzags. Averigüe el motivo de esto.</li>
            </ol>
        </div>
        <p>Debido al problema del calor, los fabricantes de chips han abandonado los avances en hacer que los procesadores funcionen a velocidades m&aacute;s altas. En cambio, est&aacute;n colocando m&aacute;s de un procesador en un chip. Si un c&aacute;lculo puede llevar a cabo el mismo algoritmo en diferentes partes de los datos al mismo tiempo (en paralelo, una especie de clones de sprites que ejecutan el mismo script al mismo tiempo), estos chips <em>multin&uacute;cleo</em> pueden tener una velocidad efectiva mucho mayor que la velocidad de un solo procesador. Una computadora que se compre hoy en d&iacute;a es muy probable que tenga instalado dos o cuatro procesadores en un solo chip. Pero usar m&uacute;ltiples n&uacute;cleos m&aacute;s eficientemente requiere que el software sea escrito tendiendo en cuenta los m&uacute;ltiples n&uacute;cleos.</p> 
        
        <div class="endnote">
            <a href="#hint-target" data-toggle="collapse" title="Aprenda sobre las limitaciones de la Ley de Moore">Aprenda sobre las limitaciones de la Ley de Moore.</a>
            <div id="hint-target" class="collapse">
                <p>En alg&uacute;n momento de la pr&oacute;xima d&eacute;cada, el tama&ntilde;o de un transistor se acercar&aacute; al tama&ntilde;o de un &aacute;tomo, pero a escala at&oacute;mica, los transistores no funcionar&aacute;n por varias razones. Hay un l&iacute;mite m&aacute;s fundamental para la densidad de los transistores en un chip que solo los problemas de calor. Y de manera similar, existen limitaciones fundamentales que afectan la velocidad de un procesador, como la velocidad de los electrones a trav&eacute;s de un cable.</p>
                <p>Los optimistas de la Ley de Moore argumentan que las tecnolog&iacute;as distintas de los transistores ser&aacute;n utilizables antes de que los fabricantes alcancen un l&iacute;mite fundamental. Uno de estos enfoques implicar&iacute;a usar un electr&oacute;n individual para representar un bit. Los electrones son m&aacute;s peque&ntilde;os que los &aacute;tomos, por lo que esta tecnolog&iacute;a permitir&iacute;a mayores aumentos dram&aacute;ticos en la densidad. Otro enfoque usar&iacute;a rayos de luz en lugar de corriente el&eacute;ctrica para mantener los bits. Pero estos desarrollos a&uacute;n est&aacute;n muy lejos.</p>
            </div>
        </div>
        
        <div class="forYouToDo">
			<ol start="2">
				<li>
                    <!-- Question 1 -->
                    <div class="assessment-data" type="multiplechoice" identifier="Which is TRUE according to Moore's Law?"
                        hasinlinefeedback="true" maxchoices="1" responseIdentifier="ri1" shuffle="true">
                        <div class="prompt">Como Gordon Moore observ&oacute; en 1965, los datos muestran que las velocidades de procesamiento por computadora se duplican aproximadamente cada dos a&ntilde;os. Las empresas de tecnolog&iacute;a utilizan esta observaci&oacute;n, ahora conocida como &quot;Ley de Moore&quot;, en su planificaci&oacute;n. De lo siguiente, identifique cu&aacute;l describe mejor c&oacute;mo las empresas de tecnolog&iacute;a pueden utilizar la Ley de Moore en la planificaci&oacute;n.</div>
                        <div class="choice" identifier="c1">
                            <div class="text">Pueden esperar duplicar sus ganancias cada dos años.</div>
                            <div class="feedback">No es posible predecir tal cosa usando la Ley de Moore.</div>
                        </div>
                        <div class="choice" identifier="c2">
                            <div class="text">Pueden anticipar las fechas precisas en que estar&aacute;n disponibles los &uacute;ltimos avances inform&aacute;ticos y, por lo tanto, planificar con precisi&oacute;n sus productos con anticipaci&oacute;n.</div>
                            <div class="feedback">No es posible predecir tal cosa usando la Ley de Moore.</div>
                        </div>
                        <div class="choice" identifier="c3">
                            <div class="text">Pueden basar sus objetivos de Investigación y Desarrollo en las velocidades de procesamiento futuras esperadas.</div>
                            <div class="feedback">Correcto.</div>
                        </div>
                        <div class="choice" identifier="c4">
                            <div class="text">Pueden esperar que sus costos se dupliquen con cada aumento en la velocidad del procesador.</div>
                            <div class="feedback">No es posible predecir tal cosa usando la Ley de Moore.</div>
                        </div>
                        <div class="responseDeclaration" identifier="ri1">
                            <div class="correctResponse" identifier="c3"></div>
                        </div>
                    </div>

                </li>
			</ol>
		</div>
		

    
    </body>
</html>
