<!DOCTYPE html>
<html lang="es">
	<head>
		<meta charset="utf-8">
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Unidad 6 Laboratorio 1: Jerarquía de abstracción computacional, Página 1</title>
	</head>
    <body>
		<h2>Abstracci&oacute;n dentro de la computadora</h2>
        <p>En la Unidad 4 <a href="/bjc-r/cur/programming/4-internet/old/2-communication-protocols/3-open-protocols.es.html?topic=nyc_bjc%2F4-internet.es.topic&amp;course=bjc4nyc.es.html&amp;novideo&amp;noassignment" title="A Hierarchy of Open Protocols">Una jerarqu&iacute;a de protocolos abiertos</a>, viste que el software de Internet est&aacute; organizado en varios niveles de abstracci&oacute;n, con programas de aplicaci&oacute;n (como tu programa de correo electr&oacute;nico) en el nivel m&aacute;s alto y protocolos de red de hardware como Wi-Fi y Ethernet en el nivel m&aacute;s bajo. Recuerda que los niveles <em>m&aacute;s altos</em> est&aacute;n m&aacute;s cerca de cómo piensan los usuarios; los niveles inferiores est&aacute;n m&aacute;s cerca de cómo funcionan las m&aacute;quinas.</p>
        <p>Al igual que Internet, la forma en que una computadora funciona internamente, tambi&eacute;n tiene niveles de abstracci&oacute;n.</p>

		<div class="learn">
			<p><strong>En este laboratorio</strong>, aprender&aacute;s acerca de los niveles de abstracci&oacute;n en el software y el hardware de la computadora.</p>
			<p><strong>En esta p&aacute;gina</strong>, aprender&aacute;s a obtener una visi&oacute;n general de tres grupos (<em>dominios</em>) de niveles de abstracci&oacute;n.</p>
        </div>

        <p>Hay muchos niveles de abstracci&oacute;n en el funcionamiento de las computadoras. Aqu&iacute; se organizan en tres dominios generales:</p>

		<img class="indent noshadow" src="/bjc-r/img/6-computers/hardware-abstraction.es.png" alt="diagrama de jerarquía de abstracción de computadora que muestra tres niveles de abstracción decreciente: dominio de software (que incluye aplicaciones, lenguajes de programación, bibliotecas y sistemas operativos), dominio digital (que incluye arquitectura, componentes, circuitos integrados y compuertas lógicas) y dominio analógico (que incluye transistores); hay una línea divisoria entre los dominios de software y digital etiquetada como 'barrera de abstracción de programa' y una línea divisoria entre los dominios digital y analógico etiquetada como 'barrera de abstracción digital'; hay una flecha vertical de doble cabeza a la derecha que indica que los elementos enumerados primero en la lista (y sus sublistas) tienen un 'alto nivel de abstracción' y los que están más abajo en la lista tienen un 'bajo nivel de abstracción'" title="diagrama de jerarquía de abstracción de computadora que muestra tres niveles de abstracción decreciente: dominio de software (que incluye aplicaciones, lenguajes de programación, bibliotecas y sistemas operativos), dominio digital (que incluye arquitectura, componentes, circuitos integrados y compuertas lógicas) y dominio analógico (que incluye transistores); hay una línea divisoria entre los dominios de software y digital etiquetada como 'barrera de abstracción de programa' y una línea divisoria entre los dominios digital y analógico etiquetada como 'barrera de abstracción digital'; hay una flecha vertical de doble cabeza a la derecha que indica que los elementos enumerados primero en la lista (y sus sublistas) tienen un 'alto nivel de abstracción' y los que están más abajo en la lista tienen un 'bajo nivel de abstracción'">
        <div class="endnote">Diferentes personas podr&iacute;an dibujar este diagrama de forma ligeramente diferente, as&iacute; que no intentes memorizar todos los niveles. Los niveles de abstracci&oacute;n clave para recordar son el software, el hardware de la computadora digital, y los componentes de los circuitos anal&oacute;gicos correspondientes.</div>

        <h3>Dominio de software</h3>
        <p>
            Los programas que escribes y usas son software, pero debajo de estos programas hay m&aacute;s software que les ayuda a funcionar. En este laboratorio, veremos cuatro capas de abstracci&oacute;n en el dominio de software:
            <ul>
                <li><strong>Aplicaciones</strong> que escribes y utilizas</li>
                <li><strong>Lenguajes de programaci&oacute;n</strong> que son utilizados para escribirlos</li>
                <li><strong>Librer&iacute;as</strong> de funciones &uacute;tiles que ocultan detalles desordenados</li>
                <li><strong>Sistemas operativos</strong> que interact&uacute;an con el hardware</li>
            </ul>
        </p>
        <p>El Software es una <em>abstracci&oacute;n</em>&mdash;una forma de pensar en la computadora sin pensar en c&oacute;mo funciona internamente.</p>
        <div class="endnote">Del mismo modo, un conductor de autom&oacute;vil est&aacute; operando a un alto nivel de abstracci&oacute;n cuando usa el pedal de freno. Mientras los ingenieros y mec&aacute;nicos dise&ntilde;en y construyan bien el auto, los conductores no necesitan saber los detalles sobre <em>c&oacute;mo </em>trabaja el sistema de frenos &mdash; solo lo usan a un alto nivel.</div>
        <div class="captioned">
            <img class="inline" src="/bjc-r/img/6-computers/motherboard_small.jpg" alt="placa base" title="placa base">
            <div><small>Imagen del usuario de Wikipedia Julianprescott2604juuly</small></div>
        </div>

        <h3>Dominio digital</h3>
        <p>
        	En el dominio del software, cada nivel de abstracci&oacute;n es una pieza de software diferente, pero los niveles de abstracci&oacute;n en el dominio digital son diferentes maneras de pensar sobre el mismo objeto f&iacute;sico. Los circuitos dentro de una computadora son complicados, y para hacer posible su construcci&oacute;n, los ingenieros piensan en varios niveles diferentes de abstracci&oacute;n:
			<ul>
                <li>La <strong>arquitectura</strong> son las instrucciones que el software puede enviar y que el hardware entender&aacute;.</li>
                <li>La computadora tiene <strong>componentes</strong> (como la memoria, procesadores, tarjetas de video, etc.) la arquitectura implementada.</li>
                <li>Esos componentes est&aacute;n construidos a partir de <strong>circuitos integrados (chips)</strong>, que son los rect&aacute;ngulos negros que puedes ver en esta placa de circuito.</li>
                <li>Esos circuitos integrados est&aacute;n dise&ntilde;ados alrededor de <strong>compuertas l&oacute;gicas</strong>, los bloques de construcci&oacute;n fundamentales que implementan las funciones booleanas.
                    <div class="endnote">
                        Aprendiste acerca de las funciones booleanas en <a href="/bjc-r/cur/programming/2-complexity/3-predicates/1-what-is-predicate.es.html?topic=nyc_bjc%2F2-conditionals-abstraction.es.topic&amp;course=bjc4nyc.es.html&amp;novideo&amp;noassignment">Unidad 2 Laboratorio 3: ¿Qué es un predicado?</a><br>
                        <img class="indent" src="/bjc-r/img/blocks/and.es.png" alt="() y ()" title="() y ()">
                        <img class="indent" src="/bjc-r/img/blocks/or.es.png" alt="() o ()" title="() o ()">
                        <img class="indent" src="/bjc-r/img/blocks/not.es.png" alt="no ()" title="no ()">
                    </div>
                </li>
            </ul>
        </p>

        <h3>Dominio an&aacute;logo</h3>
        <p>Las compuertas l&oacute;gicas, que son el nivel de abstracci&oacute;n m&aacute;s bajo del dominio digital, operan con unos y ceros. En la realidad f&iacute;sica, estas compuertas l&oacute;gicas est&aacute;n construidas a partir de <strong>transistores</strong>, un tipo de componente de circuito. Los transistores no son como los interruptores de luz que se encienden o se apagan. Pueden haber valores intermedios (como "encendido solo el 23%"). As&iacute; que los ingenieros el&eacute;ctricos tienen que pensar en las leyes de la electr&oacute;nica para dise&ntilde;ar circuitos digitales.</p>
		
        <div class="vocabFullWidth">: <strong>An&aacute;logo</strong> vs. <strong>digital</strong>
			<p>Digital y an&aacute;logo son conceptos opuestos. <strong>Digital</strong> significa informaci&oacute;n que es representada en <em>unos y ceros</em>. <strong>An&aacute;logo</strong> (<em>analog</em>) significa informaci&oacute;n que es representada por se&ntilde;ales que <em>var&iacute;an constantemente</em> (es decir, que incluyen los valores intermedios).</p>
        </div>

	</body>
</html>