<!DOCTYPE html>
<html lang="es">
	<head>
		<meta charset="utf-8">
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Unidad 6 Laboratorio 1: Jerarquía de abstracción computacional, Página 4</title>
	</head>
    <body>
        <h2>Dominio del software: Bibliotecas</h2>
        <div class="learn"><strong>En esta p&aacute;gina</strong>, aprender&aacute;s que una biblioteca es un paquete de procedimientos escritos por otros programadores que ayuda a resolver un problema.</div>

        <p>Supongamos que un programador quiere que una imagen se mueva en una pantalla que tambi&eacute;n tiene otras im&aacute;genes. En Snap<em>!</em>, esto está incorporado: importa una imagen como el <em>disfraz</em> de un objeto, y luego mu&eacute;velo moviendo el objeto. La abstracci&oacute;n del objeto permite a un programador mover una imagen sobre otras im&aacute;genes sin pensar en lo que sucede donde las im&aacute;genes se superponen o en c&oacute;mo recuperar partes de la imagen despu&eacute;s de que se cubren. No todos los lenguajes tienen la abstracci&oacute;n de los objetos.</p>
        <p>Otras tareas comunes (como saber d&oacute;nde est&aacute; el puntero del rat&oacute;n, hacer aritm&eacute;tica con n&uacute;meros enormes o controlar el sonido) tambi&eacute;n tienen partes complejas. Si los programadores tuvieran que tratar con todos estos detalles en cada programa, ning&uacute;n software se desarrollar&iacute;a. Y como muchas aplicaciones necesitan las mismas habilidades, los programadores escriben <em>bibliotecas</em> para que otros programadores las utilicen.</p>
		<div class="vocabFullWidth"><strong>: Bibliotecas de software</strong>
			<div class="ap-standard">AAP-3.D.1, AAP-3.D.2, AAP-3.D.3</div>
            <ul>
                <li>Una <strong>biblioteca de software</strong> (<em>software library</em>) es un paquete de procedimientos que puedes importar a tu programa. Una biblioteca es un tipo de abstracci&oacute;n: no es necesario que conozcas los detalles de c&oacute;mo est&aacute; codificada. Puedes construir bibliotecas por ti mismo, o puedes usar una que haya escrito otra persona.</li>
            </ul>
		</div>

        <h3>Lenguajes vs. bibliotecas</h3>
        <p>A menudo, cuando la gente compara lo que los diferentes lenguajes de programaci&oacute;n pueden hacer, est&aacute;n <em>realmente</em> comparando bibliotecas. Por ejemplo, las personas pueden pensar que les gusta JavaScript porque pueden utilizar este para programar p&aacute;ginas web, pero esa no es una propiedad de JavaScript. Realmente este es una <em>biblioteca </em>de p&aacute;ginas web incorporado en el navegador que te permite programar p&aacute;ginas web.</p>

        <h3>Bibliotecas de Snap<em>!</em></h3>
        <p>
            Ya has usado bibliotecas en Snap<em>!</em>. Por ejemplo, cuando importaste la biblioteca "an&aacute;lisis de la distribuci&oacute;n de frecuencias" en <a href="/bjc-r/cur/programming/5-algorithms/3-turning-data-information/4-filtering-data.es.html?topic=nyc_bjc%2F5-algorithms.es.topic&amp;course=bjc4nyc.es.html&amp;novideo&amp;noassignment" title="Unidad 5 Laboratorio 3 P&aacute;gina 4: Análisis de datos">Unidad 5 Laboratorio 3 P&aacute;gina 4: Análisis de datos</a>.
        </p>

        <div class="forYouToDo" id="first">
		<div class="ap-standard">AAP-3.D</div>
            <ol>
				<li>Lee las bibliotecas enlistadas en Snap<em>!</em> (como se mostraron arriba) y elige un bloque que te interese y nunca hayas utilizado. Construye un peque&ntilde;o proyecto que utilice ese bloque y usa tu proyecto para ense&ntilde;ar ese bloque a algunos de tus compa&ntilde;eros de clase.</li>
			</ol>
		</div>


	</body>
</html>
