<!DOCTYPE html>
<html lang="es">
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8">
		
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Unidad 6 Lab 1: Abstracción dentro de la computadora, Página 5</title>
	</head>
    <body>
        <h2>Dominio de software: Sistemas operativos</h2>
        <div class="todo">
            <p>MF: lightly clean up to make the text more concise</p>    
        </div>
        
        <div class="learn"><strong>En esta p&aacute;gina</strong>, aprender&aacute;s sobre el software que gestiona directamente el hardware del ordenador, el <em>sistema operativo.</em></div>   
        <p>Tu computadora vino con un <em>sistema operativo</em> (SO) instalado. Los sistemas operativos son los programas fundamentales con los que interact&uacute;an tus aplicaciones para comunicarse con la computadora. Para las computadoras con teclados, probablemente sea Linux, MacOS o Windows. Para tel&eacute;fonos y tabletas, probablemente sea Android o iOS. </p>
        <p>
            En t&eacute;rminos generales, el sistema operativo se encarga de las tareas b&aacute;sicas de las que dependen tus aplicaciones, incluyendo:
			</p>
<ul>
                <li>el sistema de ventanas, que permite que se abra m&aacute;s de una ventana en tu pantalla</li>
                <li>el administrador de archivos, que muestra el contenido de las carpetas y permite seleccionar los archivos para leer o manipular</li>
                <li>comunicaci&oacute;n con dispositivos externos como el teclado o la impresora</li>
                <li>herramientas como un simple editor de texto o una calculadora</li>
			</ul>
        <p></p>

        <div class="takeNote">En una computadora, hay muchas aplicaciones y tareas del sistema operativo que quieren ejecutarse a la vez. Cada sistema operativo tiene un <em>n&uacute;cleo </em>que gestiona cuando todos estos procesos se ejecutan.</div>
                
        <div class="endnote">
            <h3>El n&uacute;cleo</h3>
            <p>
                El <em>n&uacute;cleo</em> se ocupa directamente del hardware (teclado, rat&oacute;n, micr&oacute;fono, c&aacute;mara, discos duros, memoria, impresora, altavoces, pantalla, etc.). As&iacute; que el n&uacute;cleo est&aacute; generalmente escrito en un lenguaje de bajo nivel para que pueda controlar ese hardware. Se encarga de varias tareas importantes:
                </p>
<ul>
                    <li><strong>Programar.</strong> El n&uacute;cleo tiene acceso al reloj de tiempo que est&aacute; incorporado en el hardware y permite que cada programa se ejecute durante una peque&ntilde;a cantidad de tiempo (t&iacute;picamente alrededor de 1/10 de segundo) y luego cambia al siguiente programa en l&iacute;nea.</li>
                    <li><strong>Seguridad.</strong> Esos muchos programas de aplicaci&oacute;n pueden tener errores o c&oacute;digo malicioso. El n&uacute;cleo, que tiene acceso a la <em>memoria</em> donde se almacenan los programas y los datos, asegura que a cada programa se le asigne una ubicaci&oacute;n separada en la memoria y no interfiera con otros programas. El n&uacute;cleo tambi&eacute;n controla qu&eacute; archivos de datos puede usar un programa bas&aacute;ndose en la configuraci&oacute;n de <em>protecci&oacute;n de archivos</em> los usuarios o las aplicaciones especifican para cada archivo.</li>
                    <li><strong>Entrada y salida</strong> Se pueden conectar muchos dispositivos a la computadora. El n&uacute;cleo sabe c&oacute;mo el hardware de la computadora lee o escribe en cada dispositivo. S&oacute;lo el kernel tiene acceso directo a estos dispositivos, y realiza transferencias autorizadas de informaci&oacute;n para las aplicaciones.</li>
                </ul>
            <p></p>
            <p>Hoy en d&iacute;a, los n&uacute;cleos OS son notablemente similares. De los cinco sistemas listados anteriormente (Linux, macOS, Windows, Android, e iOS), cuatro de ellos (todos menos Windows) est&aacute;n basados en variantes de un solo n&uacute;cleo, llamado Unix.</p>        
            <p><a href="#hint-unix" data-toggle="collapse" title="Read more about Unix">Lee m&aacute;s informaci&oacute;n acerca de Unix.</a></p>
            <div id="hint-unix" class="collapse">
                <div class="comment">This still needs editing. If we find a way to cut this back, more students will actually read it. --MF, 11/8/17</div>
                <p>("Unix" es una marca registrada, actualmente propiedad de The Open Group, y no todas las variantes que se discuten aqu&iacute; est&aacute;n autorizadas a usar ese nombre, pero todas ellas proporcionan esencialmente la misma interfaz de programa). Unix fue creado alrededor de 1970 por Ken Thompson y Dennis Ritchie en los Laboratorios AT&amp;T Bell.</p>
                <p>Antes de Unix, casi todo el mundo pensaba que un sistema operativo ten&iacute;a que ser desarrollado para una arquitectura de computadora en particular, y ten&iacute;a que ser escrito en el lenguaje de m&aacute;quina de esa computadora, las instrucciones de muy bajo nivel que el hardware entiende directamente. La primera versi&oacute;n de Unix tambi&eacute;n fue escrita en el lenguaje de m&aacute;quina de una computadora en particular, la Digital Equipment Corporation PDP-7. Pero los desarrolladores de Unix sab&iacute;an que el PDP-7 no era la &uacute;nica computadora del mundo, y que vendr&iacute;an otras mejores, as&iacute; que quer&iacute;an hacer que Unix fuera <em>port&aacute;til,</em> lo que significa que podr&iacute;a ser llevado a una nueva arquitectura de computadora sin una reescritura completa. As&iacute; que en 1972 Dennis Ritchie invent&oacute; el lenguaje de programaci&oacute;n C para ese prop&oacute;sito. El C es similar a otros lenguajes disponibles en esa &eacute;poca, pero con una caracter&iacute;stica a&ntilde;adida: un programador de C puede leer o escribir cualquier byte individual de la memoria del programa conociendo su <em>direcci&oacute;n,</em> un n&uacute;mero que lo distingue de otros bytes. (Puedes ver que esta caracter&iacute;stica es bastante opuesta a la abstracci&oacute;n de alto nivel. S&oacute;lo es &uacute;til para un programador que est&aacute; pensando en detalle sobre qu&eacute; es y d&oacute;nde est&aacute; en la memoria del ordenador). Unix fue entonces reescrito en C.</p>
                <p>Debido a su portabilidad, Unix se extendi&oacute; r&aacute;pidamente a muchas arquitecturas de computadoras. Los investigadores de Berkeley desarrollaron una versi&oacute;n, basada en la versi&oacute;n de AT&amp;T, con <em>memoria virtual,</em> la capacidad de ejecutar un programa que s&oacute;lo est&aacute; parcialmente en la memoria principal del ordenador, con el resto guardado en un disco. Esta versi&oacute;n de Berkeley es un ancestro de los sistemas operativos de Apple, macOS (desde macOS 10.0) e iOS. (Una computadora Apple no se comporta como una computadora Unix, pero las diferencias est&aacute;n casi todas en los programas de nivel de aplicaci&oacute;n, no en el n&uacute;cleo.) Android, el sistema operativo de Google para tel&eacute;fonos celulares y tabletas, est&aacute; basado en Linux, una reescritura completa de Unix escrita originalmente por Linus Torvalds, quien era, en ese momento, un estudiante de inform&aacute;tica en Finlandia.</p>
                <p>Los programas a nivel de aplicaci&oacute;n que formaban parte del paquete original de Unix han sido reemplazados, en la mayor&iacute;a de los sistemas, por programas reescritos del paquete GNU (acr&oacute;nimo de Gnu's Not Unix) de la Fundaci&oacute;n para el Software Libre.</p>
            </div>
        </div>
        
		<div class="ifTime" type="first">
            <ol>
            	<li>
                    Explora los programas que se est&aacute;n ejecutando en tu computadora ahora mismo.
                    
<ol>
                        <li>Averigua c&oacute;mo hacer una lista de todos los programas que se est&aacute;n ejecutando ahora mismo en tu computadora, y recopila dicha lista de programas en un archivo de texto.</li>
                        <li>Cuenta cu&aacute;ntos de ellos son programas que <i>le pediste</i> a la computadora que ejecutara.</li>
                        <li>Del resto, &iquest;puedes averiguar a partir de los nombres lo que hacen?</li>
                        <li>&iquest;Cu&aacute;les son parte del sistema operativo (no el n&uacute;cleo del sistema operativo)?</li>
                        <li>Mira si puedes averiguar el prop&oacute;sito de algunos nombres extra&ntilde;os haciendo una b&uacute;squeda en la web.</li>
                    </ol>
                </li>
            </ol>
        </div>
        
        
    

</body></html>
