<!DOCTYPE html>
<html lang="en">
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8">
		
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Unidad 5 Lab 2: Simulaciones, Página 1</title>
    </head>
    
    <body>
        <h2>¿Por qué utilizar simulaciones?</h2>
        <div class="learn">
            <p><strong>En este laboratorio,</strong> explorar&aacute;s c&oacute;mo se pueden utilizar las simulaciones para obtener una visi&oacute;n de los fen&oacute;menos del mundo real.</p>
            <p><strong>En esta p&aacute;gina,</strong> aprender&aacute;s por qu&eacute; se usan simulaciones en lugar de experimentos del mundo real.</p>
        </div>
        
        <div class="vocabFullWidth">
            <div class="comment">AAP-3.F.1, AAP-3.F.2</div>
            <p><strong>Las simulaciones</strong> son representaciones por ordenador de cosas o situaciones reales que var&iacute;an con el tiempo. Una simulaci&oacute;n es una abstracci&oacute;n dise&ntilde;ada para un prop&oacute;sito en particular.</p>
        </div>
        
        <div class="comment">AAP-3.F.3, AAP-3.F.6</div>
        <p>
            Hay muchas razones para usar simulaciones por computadora en lugar de experimentos en el mundo real para probar cosas sobre una situaci&oacute;n. Experimentar en el mundo real puede ser:
            </p>
<ul>
                <li><strong>Caro</strong>, como probar un nuevo avi&oacute;n propuesto que podr&iacute;a caerse en pedazos con vientos fuertes. Una simulaci&oacute;n del avi&oacute;n y del viento puede eliminar algunos malos dise&ntilde;os antes de construir y probar un avi&oacute;n real.</li>
                <li><strong>Requiere mucho tiempo</strong>, como la prueba de los efectos de una mutaci&oacute;n gen&eacute;tica en una especie a trav&eacute;s de las generaciones.</li>
                <li><strong>Peligroso</strong>, como probar si un reactor nuclear sobrevivir&aacute; a un terremoto.</li>
                <li><strong>No es &eacute;tico</strong>, como dar a una poblaci&oacute;n una enfermedad para comprobar la rapidez con la que se propaga.</li>
        	</ul>
        <p></p>
        <div class="comment">AAP-3.F.4</div>
        <p>Las simulaciones por ordenador rara vez captan toda la complejidad de las situaciones reales. Por ejemplo, las simulaciones del cambio clim&aacute;tico global deber&iacute;an tener en cuenta cientos de factores interconectados como los patrones de viento, el curso de los r&iacute;os, las fallas geol&oacute;gicas que causan los terremotos y las interacciones de las plantas y animales locales. Sin embargo, debido a las limitaciones en la velocidad de las computadoras, los investigadores dejan de lado los detalles para hacer que las simulaciones sean pr&aacute;cticas.</p>
        <div class="comment">AAP-3.F.5</div>
        <p>Hay riesgos al hacer simplificaciones. Por ejemplo, puede haber una interacci&oacute;n entre elementos de la situaci&oacute;n real que no es obvia pero que resulta ser crucial. Una simplificaci&oacute;n podr&iacute;a perder los detalles que habr&iacute;an mostrado esa interacci&oacute;n. Otra cuesti&oacute;n es que si tiene ideas en mente sobre lo que est&aacute; sucediendo, es m&aacute;s probable que enfatices los detalles -incluso inconscientemente- que respaldan tus ideas. (Este tipo de distorsi&oacute;n es tan com&uacute;n que los investigadores tienen un nombre para ello: <em>sesgo de confirmaci&oacute;n</em>.)</p>
        
        <div class="forYouToDo" id="first">
            <ol>
                <li>Presenta algunos ejemplos de fen&oacute;menos complejos de la vida real para los cuales ser&iacute;a impr&aacute;ctico, imposible, peligroso o poco &eacute;tico llevar a cabo experimentos en el mundo real.</li>
                <div class="comment">AAP-3.F part a, AAP-3.F part b</div>
                <li>Explica c&oacute;mo las simulaciones pueden ayudar a nuestra comprensi&oacute;n de estos fen&oacute;menos. &iquest;Cu&aacute;les son algunas ventajas y desventajas de usar las computadoras para explorar estas situaciones?</li>
        	</ol>
        </div>
    
    

</body></html>
