<!DOCTYPE html>
<html lang="en">
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8">

		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
        <script type="text/javascript" src="/bjc-r/utilities/gifffer.min.js"></script>
		<script type="text/javascript">window.onload = function() {Gifffer();}</script>
        <link rel="stylesheet" type="text/css" href="/bjc-r/css/bjc-gifffer.css">
		<title>Unidad 5 Laboratorio 2: Simulaciones, Página 2</title>
	</head>

	<body>
        <h2>Proyecto de propagación de enfermedades</h2>
		<div class="todo">
            <h3>
<p>Need to rework the solutions so it is a reporter and actually answers the new exercises. Also page is no longer optional. --MF, 8/30/19</p></h3>
        </div>
        <div class="todo">
            <p>Brian wants to do something with a real example (like weather modeling). --MF, 2/20/18</p>
            <p>PG: SCRAP. What I really mean is change, but major change. Again, what we're seeing is how clever someone else can be. Learning to model is different. The first few pages of DHH's Calculus text does a great job if building an intellectual model that could be programmed in Snap. Weather could be ok, but I think the disease spread might be easier to understand and model. I'd keep the /idea/ here, but stop trying to show off /our/ projects and instead teach a kid how to model.</p>
        </div>

		<div class="learn">
            <p><strong>En esta página,</strong> modelarás la propagación de una enfermedad en una poblaci&oacute;n.</p>
            <img class="indent" data-gifffer="/bjc-r/img/5-algorithms/img_disease-spread/disease-spread.gif" alt="Simulation of a disease spreading in a population.  A single infected individual eventually causes everyone to be infected." title="Simulation of a disease spreading in a population.  A single infected individual eventually causes everyone to be infected." height="300">
        </div>
        <p>Supongamos que eres un investigador m&eacute;dico de los Centros para el Control de Enfermedades (CCE) y quisieras entender los factores que contribuyen a la propagaci&oacute;n de una nueva enfermedad. En particular, deseas saber el efecto del tama&ntilde;o de la poblaci&oacute;n en el tiempo que le toma a cada uno ser infectado.</p>

        <div class="forYouToDo" id="first">
            <ol>
            	<li><img class="inline" src="/bjc-r/img/icons/talk-with-your-partner.es.png" alt="Habla con tu compañero" title="Habla con tu compañero"> &iquest;Cu&aacute;l ser&iacute;a una hip&oacute;tesis sensata sobre c&oacute;mo el tama&ntilde;o de la poblaci&oacute;n afecta al tiempo transcurrido?</li>
                <li>&iquest;Y si el espacio en el que viv&iacute;a la gente (en la simulaci&oacute;n, el tama&ntilde;o del escenario de Snap<em>!</em>) era el doble de grande?</li>
            </ol>
        </div>

        <p>Es posible que no tengas suficientes datos de los brotes reales para probar tu hip&oacute;tesis y sacar conclusiones significativas, y no ser&iacute;a &eacute;tico inducir la enfermedad en una poblaci&oacute;n s&oacute;lo para recoger nuevos datos. En esta situaci&oacute;n, una simulaci&oacute;n ser&iacute;a la mejor opci&oacute;n para generar datos para probar tu hip&oacute;tesis sin las limitaciones de tiempo, costo y &eacute;tica.</p>
        <p>En este proyecto, simular&aacute;s la propagaci&oacute;n de una enfermedad dentro de una peque&ntilde;a poblaci&oacute;n y explorar&aacute;s los efectos de variables como el tama&ntilde;o de la poblaci&oacute;n y la velocidad de la interacci&oacute;n humana en la propagaci&oacute;n de la enfermedad.</p>

        <div class="forYouToDo" id="second">
            <ol start="3">
                <li>
                    Escribe una simulaci&oacute;n que:<br>
					<ul>
                        <div class="sidenoteBig">&iquest;C&oacute;mo se hace una colecci&oacute;n de sprites id&eacute;nticos? Crea un sprite de una sola persona, y utiliza el bloque&nbsp; <code>crear un clon de mi mismo</code>. Aprendiste a crear el clon de un sprite en&nbsp; <a href="/bjc-r/cur/programming/3-lists/1-abstraction/5-building-tic-tac-toe.es.html?topic=nyc_bjc%2F2-conditionals-abstraction.es.topic&amp;course=bjc4nyc.es.html&amp;novideo&amp;noassignment" title="Unit 3 Lab 1 Page 5: Building a Tic-Tac-Toe Board">Unidad 3 Laboratorio 1 P&aacute;gina 5: Construyendo un tablero Tic-Tac-Toe</a>.</div>
                        <li>Toma 3 entradas: el tama&ntilde;o de la poblaci&oacute;n, el porcentaje de la poblaci&oacute;n inicialmente infectada y la velocidad a la que las personas simuladas deben desplazarse.</li>
                        <li>Infectar a una persona sana cuando tocan a una persona enferma.</li>
                        <li>Cuando toda la poblaci&oacute;n se enferme, det&eacute;n la animaci&oacute;n e informa de la duraci&oacute;n del brote.</li>
					</ul>
				</li>
            </ol>
        </div>

        <div class="endnote">El uso de clones es una forma de paralelismo. Pero como aprendiste en la <a href="/bjc-r/cur/programming/5-algorithms/1-searching-lists/8-sequential.es.html?topic=nyc_bjc%2F5-algorithms.es.topic&amp;course=bjc4nyc.es.html&amp;novideo&amp;noassignment" title="Unit 5 Lab 1 Page 8: Parallelism">Unidad 5 Laboratorio 1 P&aacute;gina 8: Paralelismo</a>, porque los clones se ejecutan en un solo procesador, la clonaci&oacute;n no te da ninguna velocidad..</div>

        <div class="forYouToDo">
			<ol start="4">
				<li><img class="imageRight" src="/bjc-r/img/icons/talk-with-your-partner.es.png" alt="Habla con tu compañero" title="Habla con tu compañero"> Discute c&oacute;mo tu simulaci&oacute;n puede ser similar y diferente a un brote de enfermedad de la vida real. Identifica la <em>simplificaci&oacute;n de supuestos</em> que hiciste en la simulaci&oacute;n.</li>
                <li>
                    <div class="comment">AAP-3.F.8</div>
                    Quieres saber el efecto del tama&ntilde;o de la poblaci&oacute;n en el tiempo transcurrido. Debido a que hay algo de aleatoriedad en la simulaci&oacute;n, vas a obtener alguna variaci&oacute;n en el tiempo reportado. (Esto no es un error; en la vida real, los eventos aleatorios afectan al tiempo transcurrido.) Escribe una funci&oacute;n en Snap<em>!</em> que ejecute la simulaci&oacute;n 10 veces mientras mantiene el porcentaje de infectados inicialmente en 10 y la velocidad de infecci&oacute;n en 2, e informa del tiempo promedio transcurrido.<br>
                    <img class="indent" src="/bjc-r/img/5-algorithms/average-of-disease-spread.es.png" alt="average time for disease spread with population size: ()" title="average time for disease spread with population size: ()">
                </li>
                <div class="comment">AAP-3.F.7</div>
                <li>Llama a esta funci&oacute;n cuatro veces con diferentes poblaciones (50, 100, 150 y 200) y anota los resultados. Crea una hip&oacute;tesis refinada sobre la relaci&oacute;n entre el tama&ntilde;o de la poblaci&oacute;n y el tiempo para toda la poblaci&oacute;n que se va a infectar.</li>
                <li>En los escenarios de enfermedades reales, no todo el mundo acaba enfermando. &iquest;C&oacute;mo decidir&iacute;as si las simplificaciones que utilizaste en una simulaci&oacute;n invalidan las conclusiones que podr&iacute;as obtener?</li>
			</ol>
        </div>
        <p>Este es un modelo simplificado. Hay muchas cosas que puedes hacer para que el modelo sea m&aacute;s realista. Por ejemplo, podr&iacute;as hacer que las personas infectadas se curen con el tiempo, o podr&iacute;as a&ntilde;adir sprites m&eacute;dicos que puedan curar a los sprites enfermos, pero siempre tendr&aacute;s que hacer alguna simplificaci&oacute;n.</p>
        <div class="takeItFurther">
            <ol type="A">
                <li>Ahora realiza un experimento similar manteniendo constante el tama&ntilde;o de la poblaci&oacute;n y variando el porcentaje inicialmente infectado. Plantea una hip&oacute;tesis para esta relaci&oacute;n.</li>
                <li>A continuaci&oacute;n, realiza otro experimento variando la velocidad de movimiento y manteniendo constantes el tama&ntilde;o y el porcentaje de la poblaci&oacute;n inicialmente infectada, y crea una tercera hip&oacute;tesis.</li>
                <li>Agrega algunas entradas m&aacute;s al bloque de simulaci&oacute;n. Hemos sugerido que la gente mejore despu&eacute;s de un tiempo o que se cure por los m&eacute;dicos, pero hay muchas m&aacute;s que podr&iacute;as pensar.</li>
                <li>Tienes hip&oacute;tesis para cambiar s&oacute;lo una variable, pero &iquest;qu&eacute; pasa si cambias dos cosas? &iquest;Afectan al resultado de forma independiente, o hay un efecto cruzado (por ejemplo, si las personas enfermas se curan r&aacute;pidamente, &iquest;cambia esto la relaci&oacute;n entre el tama&ntilde;o de la poblaci&oacute;n y el tiempo transcurrido)? Ejecuta experimentos para averiguarlo.</li>
                <li>Dise&ntilde;a e implementa una simulaci&oacute;n de predador-presa en Snap<em>!</em>. Por ejemplo, podr&iacute;as modelar un ambiente con poblaciones de lobos y ciervos donde el lobo se alimenta de los ciervos. &iquest;Cu&aacute;les son algunos de los par&aacute;metros que necesitas incorporar en tu modelo para poder simular fluctuaciones realistas en las poblaciones de depredadores y presas?</li>
                <li>
                    Imagina que trabajas en un banco que quiere minimizar los tiempos de espera de los clientes en la cola. El banco est&aacute; considerando dos alternativas:

<ul>
                        <li>una sola l&iacute;nea donde los clientes se paran en orden de llegada y esperan al siguiente cajero disponible, o</li>
                        <li>l&iacute;neas separadas para cada cajero. </li>
                    </ul>
                     Dise&ntilde;a e implementa dos simulaciones en Snap<em>!</em> <!--like the following linked examples (<a href="http://snap.berkeley.edu/snapsource/snap.html#present:Username=bjcsolutions&ProjectName=U5L6SingleQueue_Teacher&hideControls" target="_blank">option 1</a>, <a href="http://snap.berkeley.edu/snapsource/snap.html#present:Username=bjcsolutions&ProjectName=U5L6MultipleQueues_Teacher&hideControls" target="_blank">option 2</a>)--> para ayudar al banco a determinar <em>promedio de tiempo de espera</em> para los clientes en cada escenario con el fin de elegir la mejor opci&oacute;n.<br>
                    <img class="indent" src="/bjc-r/img/5-algorithms/img_disease-spread/single-queue.es.png" alt="Single queue" title="Single queue" height="180"><img src="/bjc-r/img/5-algorithms/img_disease-spread/multiple-queues.es.png" alt="Multiple queues" title="Multiple queues" height="180">
                </li>
            </ol>
		</div>



</body></html>
