<!DOCTYPE html>
<html lang="es">
	<head>
		<meta charset="utf-8">
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>Unidad 5 Laboratorio 6: Tres en línea contra la computadora, Página 3</title>
	</head>

    <body>
        <h2>Desarrollar una estrategia de juego</h2>
        <div class="learn">
            <p><strong>En esta p&aacute;gina</strong>, definir&aacute;s la estrategia que la computadora usar&aacute; investigando las estrategias que usan los humanos.</p>
        </div>

        <p>Ya incorporaste a tu proyecto la regla m&aacute;s b&aacute;sica de la estrategia de tres en l&iacute;nea: la computadora se mover&aacute; al <code>mejor cuadrado vacío</code> durante su turno. Pero hay otros elementos importantes para tener una buena estrategia...</p>
        <div class="forYouToDo" id="first">
			<ol>
				<li>En un papel, juega al tres en l&iacute;nea un par de veces con tu compa&ntilde;ero.</li>
				<li>Dialoga sobre la estrategia con tu compa&ntilde;ero y escriban una lista de las reglas si/entonces que ambos utilizan para jugar (por ejemplo, "si pasa esto o aquello, entonces juega aqu&iacute;").</li>
			</ol>
		</div>

		<p>La estrategia de reglas para el juego tres en l&iacute;nea tiene diferentes grados de prioridad. Por ejemplo, la regla m&aacute;s importante es "si puedo ganar en este turno, entonces jugar&eacute; en el cuadrado ganador."</p>
        <div class="forYouToDo">
            <ol start="3">
                <li>&iquest;Cu&aacute;l es la segunda regla m&aacute;s importante?</li>
				<li>
                    <img class="imageRight" src="/bjc-r/img/icons/talk-with-your-partner.es.png" alt="Habla con tu compañero" title="Habla con tu compañero"> Piensa en c&oacute;mo la computadora puede determinar si un jugador puede ganar en su siguiente turno. El bloque <span style="font-family: monospace;"></span><code>¿gan&oacute;?</code> busca un triple en el que las tres ranuras sean X u O. Describe lo que contendr&aacute;n las ranuras de un triple si el jugador O puede ganar en su pr&oacute;ximo movimiento ocupando el &uacute;ltimo cuadrado de ese triple.
                </li>
            </ol>
        </div>

        <div class="endnote">Estas tres reglas (si puedes ganar en este movimiento, hazlo; si el otro jugador puede ganar en su siguiente movimiento, bloqu&eacute;alo; y de lo contrario, solo escoge el mejor cuadrado vac&iacute;o) son parte de la mayoría de estrategias de los humanos al jugar tres en l&iacute;nea. Pero los mejores jugadores desarrollan reglas adicionales que vienen despu&eacute;s de las dos primeras, pero antes de la &uacute;ltima. Puedes explorar algunas de estas reglas en las Actividades desafiantes que se encuentran al final del laboratorio.</div>

        <div class="forYouToDo">
            <ol start="5">
              Comenzarás implementando las reglas de "Si puedo ganar..." y "Si el otro jugador puede ganar...", detectando estas situaciones primero.
              <li>Crea un bloque <img src="/bjc-r/img/5-algorithms/how-many-x-in-x-5-x-reporting.es.png" alt="¿cuántos (X) en (lista{X,5,X})? reporta 2" title="¿cuántos (X) en (lista{X,5,X})? reporta 2" />.</li>
              <li>Mira dentro del bloque <img src="/bjc-r/img/5-algorithms/wonp-x.es.png" alt="¿ganó? (X)" title="¿ganó? (X)"> que escribiste en la Unidad 3. Recuerda cómo encontrar un triple que tiene tres en línea de X u O deseado.</li>
              <li>
              <div class="sidenoteBig"><a href="#hint-what-wins" data-toggle="collapse" title="Haz clic si necesitas una pista.">Haz clic si necesitas una pista.</a>
              <div id="hint-what-wins" class="collapse">Un triple ganador posible para O en el próximo turno tiene ____ O y ____ X.</div>
              </div>
              Ahora escribe <img src="/bjc-r/img/5-algorithms/winning-triple-for-player.es.png" alt="triple ganador para jugador ()" title="triple ganador para jugador ()">. Debe reportar el primer triple que encuentre que contenga un lugar al que el jugador podría mover para ganar en el siguiente turno.<br />
                  <img class="indent" src="/bjc-r/img/5-algorithms/winning-triple-for-player-reporting.es.png" alt="triple ganador para jugador reporta{3, O, O}" title="triple ganador para jugador reporta {3, O, O}" />
              </li>
                      <li>Juega una parte del juego, luego prueba el <code>triple ganador</code> para ambas entradas (X y O). Juega un poco más, luego pruébalos de nuevo. Corrige cualquier error.</li>
                      <li>¿Qué reporta <code>triple ganador</code> si no hay un triple ganador?</li>
                      <li>Ahora escribe el bloque <img src="/bjc-r/img/5-algorithms/winning-square-for-player.es.png" alt="cuadrado ganador para jugador ()" title="cuadrado ganador para jugador ()">. Asegúrate que funciona incluso si no hay ningún cuadrado ganador. </li>
                      <div class="endnote">
                          <a href="#hint-winning-square" data-toggle="collapse" title="Haz clic para una pista sobre cómo construir un cuadrado ganador para jugador.">Haz clic para una pista sobre <code>cuadrado ganador</code>.</a>
                          <div id="hint-winning-square" class="collapse">
                              <img class="indent" src="/bjc-r/img/blocks/is-a-number.png" alt="¿es () un número?" title="¿es () un número?" />
                              <img class="indent" src="/bjc-r/img/blocks/is-a-list.png" alt="¿es () una lista?" title="¿es () una lista?" />
                          </div>
                      </div>
                      <li>Juega una parte del juego, luego prueba <code>cuadrado ganador</code> para ambos jugadores y corrige cualquier error.</li>
                      <img class="inline" src="/bjc-r/img/icons/save-now.es.png" alt="Guarda tu trabajo" title="Guarda tu trabajo" />
                  </ol>
              </div>
      
              <p>En la próxima página, usarás <code>cuadrado ganador</code> para terminar de dar una mejor estrategia a la computadora.</p>


</body></html>
