<!DOCTYPE html>
<html lang="es">
    <head>
        <meta http-equiv="content-type" content="text/html; charset=utf-8">        
        <script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
        <script type="text/javascript" src="/bjc-r/utilities/gifffer.min.js"></script>
        <script type="text/javascript">window.onload = function() {Gifffer();}</script>
        <link rel="stylesheet" type="text/css" href="/bjc-r/css/bjc-gifffer.css">
		<!--<title>Unit 5 Lab X: Tic-Tac-Toe with a Strategic Computer Player, Page 1</title>-->
        <title>Unidad 5 Laboratorio 6: Tic-Tac-Toe con un reproductor de computadora, página 3</title>        
    </head>
    
    <body>
        <h2>Desarrollando una estrategia de juego</h2>
        <div class="todo">
            <p><strong>NEXT YEAR:</strong> If this does end up in a different unit than the above, we should include some kind of review like what's on page 1. --MF, 6/7/18</p>
            <p>PG: Here again, "pay attention to the strategy you use" requires some learning before it can be executed. "I always play in the corner if I can afford to" will feel complete to a student who hasn't dissected "if I can afford to." And "play the winning move if I have one" will almost /never/ feel like something to say. It's too obvious to a human, though it must be taught as a rule to a computer.</p>
            <p>MF: Project still needs to be wrapped up and updated online</p>
        </div>

        <div class="learn">
            <!--<p><strong>In this lab</strong>, you'll make the computer play against the human player <em>strategically</em>.</p>-->
            <p><strong>En esta p&aacute;gina</strong>, definir&aacute;s la estrategia que la computadora usar&aacute; investigando las estrategias que los humanos usan.</p>
        </div>
        
        <p>Ya has incorporado en tu proyecto la regla m&aacute;s b&aacute;sica de la estrategia de tres en l&iacute;nea: la computadora se mover&aacute; a la <code>mejor casilla basilla</code> durante su turno. Pero hay otros elementos importantes para tener una buena estrategia...</p>
        <div class="forYouToDo" id="first">
			<ol>
				<li>En un papel, juega tres en l&iacute;nea un par de veces con tu compa&ntilde;ero, y pon atenci&oacute;n a la estrategia que el utiliza.</li>
				<li>Discute la estrategia con tu compa&ntilde;ero, y escribe una lista de las reglas si/entonces que ambos utilizan para jugar (por ejemplo, "si pasa esto o aquello, entonces juega aqu&iacute;").</li>
			</ol>
		</div>
		
		<p>La estrategia de reglas para el juego tres en l&iacute;nea tienen diferentes grados de prioridad. Por ejemplo, la regla m&aacute;s importante es "si puedo ganar en este turno, entonces jugar&eacute; en la casilla ganadora."</p>
        <div class="forYouToDo">
            <ol start="3">
                <li>&iquest;Cu&aacute;l es la segunda regla m&aacute;s importante?</li>
				<li>
                    <img class="imageRight" src="/bjc-r/img/icons/talk-with-your-partner.es.png" alt="Habla con tu compañero" title="Habla con tu compañero"> Piensa en c&oacute;mo la computadora puede determinar si un jugador puede ganar en su siguiente turno. El bloque <span style="font-family: monospace;">&iquest;</span><code>gan&oacute;?</code> trabaja buscando un triple en el que las tres ranuras sean X o O. Describe lo que contendr&aacute;n las ranuras de un triple si el jugador O puede ganar en su pr&oacute;ximo movimiento llenando la &uacute;ltima casilla de ese triple.
                </li>
            </ol>
        </div>
    
        <div class="endnote">Estas tres reglas (si puedes ganar en este movimiento, hazlo; si el otro jugador puede ganar en su siguiente movimiento, bloqu&eacute;alo; y de lo contrario, s&oacute;lo escoge la mejor casilla vac&iacute;a) son parte de la mayoria de estrategias de los humanos al jugar tres en l&iacute;nea. Pero los mejores jugadores desarrollan reglas adicionales que vienen despu&eacute;s de las dos primeras pero antes de la &uacute;ltimt. Puedes explorar algunas de estas reglas en los problemas Desafiantes que se encuentran al final del laboratorio.</div>
        
    
    

</body></html>
