<!DOCTYPE html>
<html lang="es">
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8">


        <script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
        <script type="text/javascript" src="/bjc-r/utilities/gifffer.min.js"></script>
        <script type="text/javascript">window.onload = function() {Gifffer();}</script>
        <link rel="stylesheet" type="text/css" href="/bjc-r/css/bjc-gifffer.css">
		<!--<title>Unit 5 Lab X: Tic-Tac-Toe with a Strategic Computer Player, Page 2</title>-->
        <title>Unidad 5 Laboratorio 6: Tic-Tac-Toe con un reproductor de computadora, página 4</title>
    </head>

    <body>
        <h2>Haciendo que la computadora juegue con estrategia</h2>
        <div class="todo">
            <p>PG: Long and hard.</p>
            <p>MF: Project still needs to be wrapped up and updated online</p>
        </div>

        <div class="learn">
            <p><strong>En esta p&aacute;gina</strong>, implementar&aacute;s las reglas de estrategia del juego tres en l&iacute;nea para hacer que la computadora juegue estrat&eacute;gicamente.</p>
        </div>

        <p>Crear&aacute;s un bloque <img src="/bjc-r/img/5-algorithms/next-move.es.png" alt="next move for computer" title="next move for computer">&nbsp; puedes enviar un mensaje a todos los clones acerca de la posici&oacute;n en la que la computadora se mover&aacute;. Como antes, s&oacute;lo el clon que coincida con el <var>n&uacute;mero de posici&oacute;n</var> har&aacute; el movimiento.</p>
        <p>
        	El c&oacute;digo para el <code>siguiente movimiento para la computadora</code> implementar&aacute; las siguientes tres reglas de estrategia:
            </p>
<ul>
                <li>Regla 1: Si yo (la computadora, jugador O) puedo ganar; hacerlo.</li>
                <li>Regla 2: Si mi oponente (el humano, jugador X) puede ganar; bloqu&eacute;alo.</li>
                <li>Regla final: De lo contrario, s&oacute;lo escoge la mejor casilla vac&iacute;a.</li>
            </ul>
		<p></p>
        <div class="endnote">Construir&aacute;s el bloque <code>siguiente movimiento para la computadora</code> utilizando dos nuevos bloques: <code>&iquest;puedo ganar ahora?</code> y <code>casilla ganadora</code>, que a&uacute;n no est&aacute;n escritos. Para empezar a crear el bloque <code>siguiente movimiento para la computadora</code>, crear&aacute;s los otros dos bloques, pero en realidad no har&aacute;n nada. S&oacute;lo ser&aacute;n para establecer el c&oacute;digo para <code>siguiente movimiento para la computadora</code>, m&aacute;s tarde los utilizar&aacute;s.</div>

        <div class="forYouToDo" id="first">
			<ol>
				<li>Si a&uacute;n no est&aacute; abierto, abre el proyecto U5-Tresenlinea.</li>
                <li>
                    Crea los nuevos dos bloques para implementar las reglas de estrategia. <!--Use the same script-local variable name, <var>player</var> for the inputs.--> Por ahora, crea <code>&iquest;puedo ganar ahora?</code> configur&aacute;lo como <code>falso</code>. No coloques a&uacute;n c&oacute;digo dentro de la <code>casilla ganadora</code> .<br>
                    <img class="indent" src="/bjc-r/img/5-algorithms/can-player-win-now.es.png" alt="can player () win now?" title="can player () win now?">
                    <img class="indent" src="/bjc-r/img/5-algorithms/winning-square-for-player.es.png" alt="winning square for player" title="winning square for player">
                    <div class="endnote">
                        <strong>&iquest;Por qu&eacute;&nbsp; <code>&iquest;puedo ganar ahora?</code> se configura como <code>falso</code>? </strong>De esta manera, la computadora se saltar&aacute; las reglas 1 y 2 y por defecto se ir&aacute; a la regla final, y as&iacute; podr&aacute;s seguir usando tu programa mientras construyes y pruebas estos dos nuevos bloques.
                    </div>
                </li>
                <li>Ahora, crea el <img src="/bjc-r/img/5-algorithms/next-move.es.png" alt="next move for computer" title="next move for computer"> bloque que implemente las reglas de estrategia utilizando estos dos nuevos bloques, y util&iacute;zalo como entrada para <code>enviar mensaje</code> en lugar de <code>mejor casilla vac&iacute;a</code>. </li>
                <div class="endnote">
                    <a href="#hint-rules" data-toggle="collapse" title="Click for a hint about implementing the strategy rules.">Da clic aqu&iacute; para ver una pista acerca de implementaci&oacute;n de reglas de estrategia.</a>
                    <div id="hint-rules" class="collapse">
	                    <p>Tambi&eacute;n utiliza el bloque <img class="inline" src="/bjc-r/img/5-algorithms/best-empty-square.es.png" alt="best empty square" title="best empty square">&nbsp; .</p>
                        <a href="#hint-bigger" data-toggle="collapse" title="Click for a bigger hint about implementing the strategy rules.">Da clic aqu&iacute; para ver una pista m&aacute;s grande acerca de implementaci&oacute;n de reglas de estrategia.</a>
                        <div id="hint-bigger" class="collapse">
                        <img class="indent" src="/bjc-r/img/5-algorithms/next-move-for-computer-definition.es.png" alt="next move for computer: { if (can player (O) win now?) {report (winning square for player (O))}, if (can player (X) win now?) {report (winning square for player (X))}, report (best empty square) } There are three comments. The first comment is on the 'if (can player (O) win now?)' line and says 'Rule 1: If computer can win; do so.' The second comment is on the 'if (can player (X) win now?)' line and says 'Rule 2: If human can win; block them.' The third comment is on the 'report (best empty square)' line and says 'Final rule: Otherwise, just pick the best empty square.'" title="next move for computer: { if (can player (O) win now?) {report (winning square for player (O))}, if (can player (X) win now?) {report (winning square for player (X))}, report (best empty square) } There are three comments. The first comment is on the 'if (can player (O) win now?)' line and says 'Rule 1: If computer can win; do so.' The second comment is on the 'if (can player (X) win now?)' line and says 'Rule 2: If human can win; block them.' The third comment is on the 'report (best empty square)' line and says 'Final rule: Otherwise, just pick the best empty square.'"></div>
                    </div>
                </div>
                <li>Juega una partida contra la computadora, y aseg&uacute;rate que el juego a&uacute;n funciona.</li>
            </ol>
        </div>

        <p>Puedes revisar el <code>estado de todos los triples ganados</code> para un triple que permitir&aacute; al jugador controlado por la computadora ganar en el siguiente turno, pero no podr&aacute;s decir la <em>posici&oacute;n</em> de la casilla a la cu&aacute;l se mover&aacute; el jugador. Para hacerlo posible, necesitar&aacute;s iniciar los espacios de la variable en el <var>tablero</var> con los n&uacute;meros de 1 a 9 en lugar de colocar nueve copias de la palabra "vac&iacute;a." Luego <img class="inline" src="/bjc-r/img/5-algorithms/winning-square-for-player.es.png" alt="winning square for player" title="winning square for player"> puede seleccionar el n&uacute;mero de posici&oacute;n del triple ganador.</p>

        <div class="forYouToDo">
            <ol start="5">
				<li>
                    Cambia la instrucci&oacute;n inicial de la variable del <var>tablero</var> a la lista de n&uacute;meros del 1al 9.


<div class="endnote">Puedes escribir los n&uacute;meros de uno en uno o utilizar <img class="inline" src="/bjc-r/img/blocks/numbers-from-to.es.png" alt="numbers from () to ()" title="numbers from () to ()">.</div>
                </li>
				<li><strong>Depurando.</strong> Juega una partida.&nbsp; Identifica las partes de tu c&oacute;digo que causan los problemas, y encuentra una soluci&oacute;n.


<div class="endnote">
                	<!--<p><a href="#hint-tie-bug" data-toggle="collapse" title="Click for a hint about what's causing the error with the board variable.">Click for a hint about what's causing the error.</a></p>
                    <div id="hint-tie-bug" class="collapse">Think: how can you tell there is a bug? What part of your code is related to what you are seeing?</div>-->
                    <p><a href="#hint-tie-bug-fix" data-toggle="collapse" title="Click for a hint about how to fix the error with the board variable.">Da clic aqu&iacute; para ver una pista de c&oacute;mo arreglar errores.</a></p>
                    <div id="hint-tie-bug-fix" class="collapse"><img class="indent" src="/bjc-r/img/blocks/is-a-number.es.png" alt="is () a number?" title="is () a number?"></div>
                </div>
                </li>
			</ol>
		</div>

        <p>Ahora empezar&aacute;s a trabajar en los bloques&nbsp; <img class="inline" src="/bjc-r/img/5-algorithms/winning-square-for-player.es.png" alt="winning square for player" title="winning square for player"> y <img class="inline" src="/bjc-r/img/5-algorithms/can-player-win-now.es.png" alt="can player () win now?" title="can player () win now?"> . El bloque <code>&iquest;puedo ganar ahora? </code>puede comprobar si hay una casilla ganadora comprobando los resultados de <code>casilla ganadora</code>, as&iacute; que primero, crear&aacute;s el c&oacute;digo para <code>casilla ganadora</code>.</p>
        <p>Empezar&aacute;s construyendo un bloque triple ganador para que el jugador identifique el contenido de las tres casillas del tablero donde el jugador podr&iacute;a ganar en su pr&oacute;ximo turno. Luego la, <code>casilla ganadora</code> seleccionar&aacute; la posici&oacute;n correcta de ese triple.<br>
            <img class="indent" src="/bjc-r/img/5-algorithms/winning-triple-for-player-reporting.es.png" alt="winning triple for player reporting {3, O, O}" title="winning triple for player reporting {3, O, O}">
            <img class="indent" src="/bjc-r/img/5-algorithms/winning-square-for-player-o-reporting.es.png" alt="winning square for player O reporting 3" title="winning square for player O reporting 3">
        </p>

        <div class="forYouToDo">
            <ol start="7">
				<li>
                    <img class="inline" src="/bjc-r/img/icons/talk-with-your-partner.es.png" alt="Habla con tu compañero" title="Habla con tu compañero"> &iquest;C&oacute;mo podr&iacute;as usar uno o m&aacute;s de los bloques que tienes para determinar si un jugador puede ganar en su pr&oacute;ximo turno?<br>
                    <img class="indent" src="/bjc-r/img/5-algorithms/board.es.png" alt="board" title="board">
					<img class="indent" src="/bjc-r/img/5-algorithms/possible-winning-triples.es.png" alt="possible winning triples" title="possible winning triples">
                    <img class="indent" src="/bjc-r/img/5-algorithms/status-of-all-winning-triples.es.png" alt="status of all winning triples" title="status of all winning triples">
                    <img class="indent" src="/bjc-r/img/5-algorithms/wonp-x.es.png" alt="won? (X)" title="won? (X)">
                    <div class="endnote">No tienes que programarlo a&uacute;n. S&oacute;lo habla de lo que podr&iacute;as hacer.</div>
                </li>
                <li>
                	Crea un bloque&nbsp; <img src="/bjc-r/img/5-algorithms/winning-triple-for-player.es.png" alt="winning triple for player ()" title="winning triple for player ()"> . Debe reportar el primer triple que encuentre que contenga un lugar donde el jugador pueda ganar.


<div class="endnote">
                    	Te puede ser &uacute;til inventar estos bloques:<br>
                        <img class="indent" src="/bjc-r/img/5-algorithms/opponent-to-o-reporting.es.png" alt="opponent to (O) reporting X" title="opponent to (O) reporting X">
                        <img class="indent" src="/bjc-r/img/5-algorithms/how-many-x-in-x-5-x-reporting.es.png" alt="number of (X) in (list{X,5,X}) reporting 2" title="number of (X) in (list{X,5,X}) reporting 2">
                        <p><a href="#hint-winning-triple" data-toggle="collapse" title="Click here for a hint about winning triple for player.">Da clic aqu&iacute; para ver una pista acerca de <code>ganando un triple</code>.</a></p>
                        <div class="collapse" id="hint-winning-triple">
                            <img class="indent" src="/bjc-r/img/5-algorithms/winning-triple-for-player-hint.es.png" alt="item (1) of (keep items such that ('The code is missing. Plain text says: You build the predicate.') from (status of all winning triples))" title="item (1) of (keep items such that ('The code is missing. Plain text says: You build the predicate.') from (status of all winning triples))">
                            <p>Aprendiste acerca de utilizar <code>mantener</code> con predicados en <a href="/bjc-r/cur/programming/2-complexity/3-predicates/5-keeping-list-items.es.html?topic=nyc_bjc%2F2-conditionals-abstraction.es.topic&amp;course=bjc4nyc.es.html&amp;novideo&amp;noassignment" title="Unit 2 Lab 3 Page 5: Keeping Items from a List">Unidad 2 Laboratorio 3 P&aacute;gina 5: <code>manteniendo </code></a><span style="color: #0000ee;">elementos de una lista.<br></span></p>
                            <p><a href="#hint-winning-triple2" data-toggle="collapse" title="Click here for abother hint about winning triple for player.">Da clic aqu&iacute; para ver otra pista acerca de <code>triple ganador</code>. <br></a></p>
							<div id="hint-winning-triple2" class="collapse">El jugador debe aparecer dos veces en el triple, pero el oponente no debe aparecer en absoluto.</div>
                        </div>
                    </div>
                </li>
                <li>Juega parte de un juego, y luego prueba el <code>triple ganador</code> para ambas entradas (X y O) Juega un poco m&aacute;s, y luego prueba ambos de nuevo. Arregla cualquier error.</li>
				<li>&iquest;Qu&eacute; reporta el<span style="font-family: monospace;"> </span><code>triple ganador</code> si no hay un triple ganador?</li>
                <li>Ahora escribe el c&oacute;digo dentro del bloque <img src="/bjc-r/img/5-algorithms/winning-square-for-player.es.png" alt="winning square for player ()" title="winning square for player ()"> . Aseg&uacute;rate de que funciona incluso si no hay una casilla ganadora. </li>
                <div class="endnote">
                	<a href="#hint-winning-square" data-toggle="collapse" title="Click for a hint about building winning square for player.">Da clic aqu&iacute; para ver una pista acerca de la <span style="font-family: monospace;">casilla ganadora</span><code></code>.</a>
                    <div id="hint-winning-square" class="collapse">
                        <img class="indent" src="/bjc-r/img/blocks/is-a-number.es.png" alt="is () a number?" title="is () a number?">
                        <img class="indent" src="/bjc-r/img/blocks/is-a-list.es.png" alt="is () a list?" title="is () a list?">
                    </div>
				</div>
                <li>Juega parte de un juego, prueba la <code>casilla ganadora</code> para ambos jugadores, y arregla cualquier error.</li>
                <li>Implementa <img class="inline" src="/bjc-r/img/5-algorithms/can-player-win-now.es.png" alt="can player () win now?" title="can player () win now?"> utilizando tu bloque <code>casilla ganadora</code>.</li>

                <li>Juega varios partidas contra el programa. Arregla cualquier error. Aseg&uacute;rate de que la computadora usa tres reglas.</li>
            </ol>
        </div>

        <div class="ifTime">
            <ol start="15">
                <li>Modifica el programa para que la computadora pueda jugar X o O. Cuando el juego comience, p&iacute;dele al jugador humano que elija X u O.</li>
				<li>Crea una forma para que el jugador decida si quiere jugar contra otro humano o contra el ordenador.</li>
            </ol>
        </div>

        <div class="takeItFurther">
            <ol type="A">
                <li>Juega contra la computadora, y encuentra una estrategia que te permita ganar el juego. (Esto no es trivial; s&oacute;lo que las reglas de la computadora que ya tienes son bastante buenas.)</li>
                <li>
                    programa m&aacute;s reglas para que la computadora sea una mejor jugadora.Esto implicar&aacute; mirar m&aacute;s de un movimiento hacia adelante. Hay varias maneras de hacerlo, y la siguiente es solo una sugerencia.


<ol type="a">
                        <li>
                            No es suficiente con buscar una jugada ganadora para ti mismo en dos movimientos a partir de ahora. Si puedes ver un movimiento as&iacute;, tambi&eacute;n lo puede hacer tu oponente, que se mover&aacute; para bloquearte. As&iacute; que lo que debes encontrar es un&nbsp; <em>tenedor: </em>dos triples en los que t&uacute; tienes una apariencia y tu oponente no tiene ninguna, y que tienen una casilla libre en com&uacute;n. Esto es mucho m&aacute;s f&aacute;cil de ver con una imagen:<br>
                            <img class="indent" src="/bjc-r/img/hof/fork.es.png" alt="board with fork" title="board with fork"><br>
                            <div class="endnote">El jugador X comenz&oacute; el juego con el movimiento de apertura est&aacute;ndar, en el centro. El jugador O respondi&oacute; pobremente, en el borde superior, y por lo tanto est&aacute; a punto de perder el juego. El jugador X jug&oacute; en la esquina superior izquierda. El jugador O tuvo que responder en la esquina inferior derecha para bloquear una victoria inmediata para el jugador X. Es el turno del jugador X. No hay una combinaci&oacute;n ganadora con dos X, ni con dos O. Pero jugador X puede encontrar <em>dos</em> combinaciones ganadoras, las marcadas con las l&iacute;neas rojas, las cuales tienen una X y dos casillas libres, <em>con una de las casillas libres en com&uacute;n</em>. En la imagen, el cuadrado com&uacute;n es el 4, el cuadrado del borde izquierdo, y ah&iacute; es donde el jugador X debe moverse.</div>
                        </li>
                        <li>Encuentra todos los triples (es decir, reporta una <em>lista de triples</em>) en el que la computadora tiene una casilla y las otras dos est&aacute;n vac&iacute;as, y guardan entonces en una variable llamada <var>individuales</var>.</li>
                        <li>
                            Haz una lista grande de todas las letras y n&uacute;meros de los triples:<br>
                            <img class="indent" src="/bjc-r/img/hof/ttt-flatten.es.png" alt="script variable(atoms); set (atoms) to (combine with(append()()) items of (singles))" title="script variable(atoms); set (atoms) to (combine with(append()()) items of (singles))"><br>
                            No tienes el bloque <code>anexar</code> en tu paleta, pero hay una en tu librer&iacute;a de Snap<em>!</em>. Da clic en el icono del men&uacute; de archivo, and choose "Librer&iacute;as..", luego elige "Lista de utilidades" en el men&uacute; para que aparezca.
                        </li>
                        <div class="endnote">"&Aacute;tomo" es un t&eacute;rmino t&eacute;cnico para un valor que no es una lista. Una lista contiene un mont&oacute;n de elementos, al igual que una mol&eacute;cula contiene un mont&oacute;n de &aacute;tomos.</div>
                        <li>Ahora encuentra un n&uacute;mero que aparezca m&aacute;s de una vez en&nbsp; <code>&aacute;tomos</code>.</li>
                        <div class="endnote">
                            <div class="todo">Need to update page number. --MF, 3/29/19</div>
                            Tu escribist&eacute; el bloque de <code>duplicados en</code> <a href="/bjc-r/cur/programming/5-algorithms/1-searching-lists/7-comparing-search-algorithms.es.html" title="Unit 5 Lab 1 Page 7: List Processing Algorithms">Unidad 5 Laboratorio 1 P&aacute;gina 7: Lista Procesando Algoritmos</a>.
                        </div>

                    </ol>
                </li>
            </ol>
        </div>




</body></html>
